{
	"items": [
	  {
		"themes": "Guidage",
		"title": "Titre de la page",
		"ID": "testID-001",
		"sous-thematique": "Incitation",
		"type": ["page"],
		"tests": [
		  "Chaque page doit avoir un titre qui lui est spécifique et qui reflète son contenu ou sa fonction."
		],
		"verifier": [
		  "Vérifier que le titre commence, en général, par le titre de la page courante puis et le nom du site. ",
		  "Vérifier que l'onglet de la page est bien renseigné par un titre et non par son adresse html, par exemple (NB : balise HTLM <title> ), par exemple : Accueil - Espace client Orange."
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Titre des rubriques",
		"ID": "testID-002",
		"sous-thematique": "Incitation",
		"type": ["titre"],
		"tests": [
		  "Il est recommandé de structurer le contenu d'une page à l'aide de titres. Cela permet à certains types d'utilisateur de repérer rapidement les grandes rubriques de la page (via  un  lecteur d’écran par exemple) pour extraire la liste des titres et d'y naviguer rapidement. "
		],
		"verifier": [
		  "Vérifier que les titres des rubriques dans la page sont bien des titres, c'est-à-dire qu'ils ont été insérés dans une balise HTML <h_> et hiérarchisés de h1 à h6 et enchainé logiquement (sans saut dans les niveaux). Vérifier également qu'ils sont pertinents en regard contenu. ",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Regroupement d'informations",
		"ID": "testID-003",
		"sous-thematique": "Groupement, distinction",
		"type": ["page"],
		"tests": [
		  "Les items, données et informations de même nature et/ou liées sémantiquement (par exemple les liens de navigation) doivent être physiquement regroupées pour faciliter leur repérage et leur identification. "
		],
		"verifier": [
		  "Vérifier que les informations de même nature sont regroupées dans les mêmes composants (la même page, la même zone dans la page, le même menu, …). Notamment, vérifier que le logo, le titre de l'application et les fonctions transverses (liens utilitaires type moteur de recherche, choix de la langue) sont placés en en-tête de page et que le plan du site, l'accès à l'aide ou la FAQ, les contacts et les mentions légales sont positionnés en pied-de-page.",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Visibilité du focus",
		"ID": "testID-004",
		"sous-thematique": "Incitation",
		"type": ["éléments cliquables"],
		"tests": [
		  "La visibilité du focus est primordiale pour des utilisateurs navigant au clavier (ou sans souris), leur permet de visualiser à chaque instant sur quel élément actif ils se trouvent."
		],
		"verifier": [
		  "Vérifier en navigant à l'aide de la touche TAB que le focus est visible sur tous les éléments le recevant (liens, boutons, éléments de formulaire).",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Apparence des liens",
		"ID": "testID-005",
		"sous-thematique": "Incitation",
		"type": ["lien"],
		"tests": [
		  "Les liens hypertextes doivent être facilement repérables visuellement par l'utilisateur."
		],
		"verifier": [
		  "Vérifier que tous les liens dans la page sont soulignés ou sont mis en évidence  via des indices visuels et que ce soit toujours fait de manière homogène :  flèche, chevron…",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Libellés des liens",
		"ID": "testID-006",
		"sous-thematique": "Incitation",
		"type": ["lien"],
		"tests": [
		  "Les liens hypertextes doivent être compréhensibles hors contexte visuel pour permettre, notamment à un utilisateur privé de ce contexte visuel (mal ou non voyant) de connaître la fonction ou la destination du lien. "
		],
		"verifier": [
		  "S'assurer que les liens du contenu donnent une bonne information sur la destination. Vérifier également que dans une page des liens ayant le même libellé ne pointent pas sur des destinations différentes.",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Navigation dans le menu",
		"ID": "testID-007",
		"sous-thematique": "Incitation",
		"type": ["menu"],
		"tests": [
		  "L'utilisateur doit toujours savoir où il se trouve dans l'application"
		],
		"verifier": [
		  "Vérifier que l'item ou la rubrique en cours de consultation est mise en évidence (exemple : mettre en surbrillance l'item de menu en cours de consultation).",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Retour à la page d'accueil",
		"ID": "testID-008",
		"sous-thematique": "Incitation",
		"type": ["navigation"],
		"tests": [
		  "L'utilisateur doit pouvoir retourner à la page d'accueil simplement."
		],
		"verifier": [
		  "Vérifier que toutes les pages intérieures de l'application disposent d'un lien retour à la page d’accueil (à défaut un clic sur le logo de l’application doit ramener l'utilisateur à la page d'accueil).",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Délai d'attente",
		"ID": "testID-009",
		"sous-thematique": "Feedback",
		"type": ["action du système, page"],
		"tests": [
		  "L'utilisateur doit être informé de toute opération système prenant plus de 3 secondes afin d'être rassuré et d'éviter des actions erronées. "
		],
		"verifier": [
		  "Quand le système travaille (i.e. prend la main), vérifier que l'utilisateur est averti :  <ul><li>par une icône d’attente (chenillard) pour un délais compris entre 2 et 6 secondes,</li> <li>par une barre de progression au delà de 6 secondes,  complétée d'une indication chiffrée et/ou une description de la tâche en cours</li><li> par une barre de progression infinie si le temps est inconnu.</li></ul>",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Contraste texte/fond",
		"ID": "testID-010",
		"sous-thematique": "Lisibilité",
		"type": ["texte"],
		"tests": [
		  "Un niveau de contraste doit être suffisant pour garantir une lisibilité confortable du texte."
		],
		"verifier": [
		  "Vérifier que le contraste entre la couleur du fond et celle du texte est de minimum 4.5:1. Ceci est également valable pour du texte sous forme d'image porteur d'information. NB: le niveau de contraste peut-être mesuré avec l'outil Colour contrast analyser ",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Police de texte",
		"ID": "testID-011",
		"sous-thematique": "Lisibilité",
		"type": ["texte"],
		"tests": [
		  "Les textes doivent être en police Helvetica Neue (Brand Orange)."
		],
		"verifier": [
		  "Vérifier que les textes sont en police Helvetica Neue  et que du gras n'est pas utilisé dans le corps du texte.",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Taille de texte",
		"ID": "testID-012",
		"sous-thematique": "Lisibilité",
		"type": ["texte"],
		"tests": [
		  "La taille des textes ne doit pas être inférieure à 12 pixels."
		],
		"verifier": [
		  "Vérifier qu'aucun texte a une taille inférieure à 12 px (rendu écran), soit 9 points.",
		],
		"resultatTest": "",
		"commentaire": ""
	  },
	  {
		"themes": "Guidage",
		"title": "Taille des titres",
		"ID": "testID-013",
		"sous-thematique": "Lisibilité",
		"type": ["titre"],
		"tests": [
		  "La taille des titres ne doit pas être supérieure à 20 pixels."
		],
		"verifier": [
		  "Vérifier qu'aucun titre a une taille  supérieure à 20 px (rendu écran), soit 14 points.",
		],
		"resultatTest": "",
		"commentaire": ""
	  }
	]
}