{
	"name": "Conformity audit WCAG / WEB",		 
	"items":[{
		"themes": "Form",
		"title": "Does every input field in the form have a label?",
		"ID": "testID-001",
		"IDorigin": "testID-001",
		"wcag": [
			"1.3.1 A",
			"2.4.6 AA",
			"3.3.2 A"
		],
		"verifier": "Verify that the accessible name of each input field is defined.",
		"group": "Form",
		"resultatTest": "nt"
	},{
		"themes": "Form",
		"title": "Is every input field's label appropriate?",
		"ID": "testID-002",
		"IDorigin": "testID-002",
		"wcag": [
			"2.4.6 AA",
			"3.3.2 A"
		],
		"verifier": "Verify that the accessible name of each input field is appropriate.",
		"group": "Form",
		"resultatTest": "nt"
	},{
		"themes": "Form",
		"title": "Are the form elements grouped where it is necessary?",
		"ID": "testID-003",
		"IDorigin": "testID-003",
		"wcag": [
			"1.3.1 A",
			"3.3.2 A"
		],
		"verifier": "<ul><li>the presence of a <code>fieldset</code> group or <code>role='group'</code></li><li>each group possesses a legend (<code>legend</code>, <code>aria-labelledby</code>)</li><li>each legend is appropriate</li></ul>",
		"complement": "<h4>Additionally: </h4><p>Group elements only when it is necessary, for example:</p><ul><li>in order to differentiate between several fields having the same label (road, postcode, town – for delivery address and billing address)</li><li>legend text is necessary in order to facilitate the choice among a list of <code>radio</code> buttons or <code>checkbox</code> elements</li></ul>",
		"group": "Form",
		"resultatTest": "nt"
	},{
		"themes": "Form",
		"title": "Are the required input fields clearly identified?",
		"ID": "testID-004",
		"IDorigin": "testID-004",
		"wcag": [
			"1.3.1 A",
			"3.3.2 A"
		],
		"verifier": "<ul><li>verify that color is not used as the only visual means for identifying that a form element is required (e.g. asterisk)</li><li>verify that one of the following techniques is used to convey programmatically the information:<ul><li>the visible information is provided within the <code>label</code></li><li>presence of <code>required</code> attribute</li><li>presence of <code>aria-required</code> property</li></ul></li></ul>",
		"group": "Form",
		"resultatTest": "nt"
	},{
		"themes": "Form",
		"title": "For the input fields which require a specific data format, is this expected data format clearly communicated to the user?",
		"ID": "testID-005",
		"IDorigin": "testID-005",
		"wcag": [
			"3.3.2 A"
		],
		"verifier": "<ul><li>check that the input format is present visually, and that its position allows it to be associated with the appropriate field</li><li>check that the input format is present in the accessible name (<code>label</code>, <code>aria-label</code>, <code>aria-labelledby</code>) or in the accessible description of the input field (<code>aria-describedby</code>)</li></ul>",
		"group": "Form",
		"resultatTest": "nt"
	},{
		"themes": "Form",
		"title": "Is an <code>autocomplete</code> attribute present for the input fields intended for personal information about the user?",
		"ID": "testID-012",
		"IDorigin": "testID-012",
		"wcag": [
			"1.3.5 AA"
		],
		"verifier": "<ul><li>for the input fields intended for information about the user (name, address…), check that the <code>autocomplete</code> attribute is present</li><li>the value indicated for the <code>autocomplete</code> attribute is appropriate with respect to the type of information expected (<a href='https://www.w3.org/TR/WCAG21/#input-purposes' lang='en'> exhaustive list of allowed values </a>)</li></ul>",
		"group": "Form",
		"resultatTest": "nt"
	},{
		"themes": "Form",
		"title": "Are the fields that are in error identified?",
		"ID": "testID-006",
		"IDorigin": "testID-006",
		"wcag": [
			"3.3.1 A"
		],
		"verifier": "<ul><li>check that the label of the field that is in error is modified (e.g. by inserting an error message into the page prefixed by the word  'error ', or by the use of an error-icon)</li><li>if the visual information does not have a text alternative (e.g. icon without alternative) then check that the field has an <code>aria-invalid='true'</code> attribute</li></ul>",
		"group": "Form",
		"resultatTest": "nt"
	},{
		"themes": "Form",
		"title": "Are the error messages explicit?",
		"ID": "testID-007",
		"IDorigin": "testID-007",
		"wcag": [
			"3.3.1 A"
		],
		"verifier": "<p>Check that an error message is present visually, and that it allows the field in error to be precisely identified and the nature of the error to be understood.</p>",
		"group": "Form",
		"resultatTest": "nt"
	},{
		"themes": "Form",
		"title": "If an error is detected, is a suggestion for correction provided to the user? ",
		"ID": "testID-008",
		"IDorigin": "testID-008",
		"wcag": [
			"3.3.3 AA"
		],
		"verifier": "<p>Check that the error messages give the information necessary about how to correct the errors.</p>\n<p>If it's impossible to make a suggestion to correctm, te  Si il n'est pas possible de suggérer une correction , the criterion is not applicable</p>",
		"group": "Form",
		"resultatTest": "nt"
	},{
		"themes": "Form",
		"title": "For each form requiring sensitive or personal data, does the user have control over their data?",
		"ID": "testID-009",
		"IDorigin": "testID-009",
		"wcag": [
			"3.3.4 AA"
		],
		"verifier": "<p>For forms that:</p><ul><li>modify or delete data,</li><li>submit user test responses,</li><li> cause legal commitments (validate terms of service) or financial transactions (online shopping) for the user to occur,</li></ul><p>the user can modify or cancel before and after validation unless the validation is explicit (e.g. use of checkbox).</p>",
		"group": "Form",
		"resultatTest": "nt"
	},{
		"themes": "Textual Content",
		"title": "Is the page title appropriate?",
		"ID": "testID-017",
		"IDorigin": "testID-017",
		"wcag": [
			"2.4.2 A"
		],
		"verifier": "<ul><li>check that there is a page title,</li><li>check that the page title is unique and allows the user to understand the context of the page.</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Textual Content",
		"title": "Is the information structured by the appropriate use of heading elements?",
		"ID": "testID-010",
		"IDorigin": "testID-010",
		"wcag": [
			"1.3.1 A",
			"2.4.1 A",
			"2.4.6 AA"
		],
		"verifier": "<ul><li>check that section headings are present, and that they represent the structure of the document</li><li>check that elements resembling headings use the correct heading tags (<code>hn</code>, <code>role='heading'</code>)</li><li>check that the heading levels are ordered in a logical manner</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Textual Content",
		"title": "Does the document possess a semantic structure?",
		"ID": "testID-068",
		"IDorigin": "testID-068",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<ul> <li>content should always be placed between semantic tags (for instance <code>p</code>) in order that its relationship to the rest of the document structure may be understood</li> <li> long quotations (paragraph) use <code>blockquote</code> tags</li> <li> short quotations use <code>q</code> tags.</li> <li> the information presented visually, in a list format, is encoded as an HTML list </li> <li> unordered lists use the <code>ul</code> / <code>li</code> tags </li> <li> ordered lists use the <code>ol</code> / <code>li</code> tags</li> <li> description lists use the <code>dl</code> / <code>dt</code> / <code>dd</code> tags</li><li>link (<code>&lt;a&gt;</code>), for any change of context via loading a new URL</li><li>button (<code>&lt;button&gt;</code>, <code>&lt;input type='button'&gt;</code>), for any triggering of an action, validation or selection</li></ul>  ",
		"resultatTest": "nt"
	},{
		"themes": "Textual Content",
		"title": "Is the source code valid?",
		"ID": "testID-064",
		"IDorigin": "testID-064",
		"wcag": [
			"4.1.1 A"
		],
		"verifier": "<p>In the HTML code make sure that:</p><ul><li>elements have complete start and end tags</li><li>elements are nested according to their specifications</li><li>elements do not contain duplicate attributes</li><li>attributes are correctly defined (quotation marks opened and closed)</li><li>each <code>id</code> attribute is unique</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Textual Content",
		"title": "Is the main language defined, and does it correspond to the document's primary language?",
		"ID": "testID-021",
		"IDorigin": "testID-021",
		"wcag": [
			"3.1.1 A"
		],
		"verifier": "<ul><li>check there is a <code>lang</code> attribute present (N.B. the presence of the <code>xml:lang</code> attribute is not sufficient to pass this test)</li><li>the value of the <code>lang</code> attribute should correspond to the primary language used on the page</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Textual Content",
		"title": "Are changes in language clearly identified?",
		"ID": "testID-022",
		"IDorigin": "testID-022",
		"wcag": [
			"3.1.2 AA"
		],
		"verifier": "<p>Check that a <code>lang</code> attribute is present for words and expressions in a foreign language.</p>",
		"exceptions": "<p>For words and expressions in a foreign language which are in everyday use (déjà vu, hors d'oeuvre…) or for proper nouns, do not indicate a change of language.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Textual Content",
		"title": "Are data tables structured correctly?",
		"ID": "testID-023",
		"IDorigin": "testID-023",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<ol><li>check that data tables have a <code>caption</code> legend that is not empty</li><li>check there is an summary that clearly describes the table structure:<ul><li><strong>HTML5</strong>: presence of a summary, if necessary off-screen accessible text or <code>display:none</code>, linked to the table via an <code>aria-describedby</code></li><li><strong>Previous version:</strong> summary present in a <code>summary</code> attribute</li></ul></li><li><strong> Tables with one header:</strong> check for the presence of header elements (<code>th</code>)</li><li><strong> Tables with two headers:</strong><ul><li>For each <code>th</code> check for the presence of a <code>scope='col'</code> attribute for the column header elements,</li><li>and for the presence of <code>scope='row'</code> for the row header elements </li></ul></li><li><strong>Complex tables:</strong> check for the presence of <code>th</code> header elements or <code>id</code> and <code>headers</code> attributes</li></ol>",
		"resultatTest": "nt"
	},{
		"themes": "Non-text Content",
		"title": "Do the images have appropriate text alternatives?",
		"ID": "testID-013",
		"IDorigin": "testID-013",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<ul><li>check the accessible name of the <code>img</code>, <code>area</code>, <code>canvas</code>, <code>SVG</code>, and of those HTML elements with <code>role='img'</code >, and also of those elements <code>input</code> and <code>object</code> that possess the attribute <code>type='image'</code> </li><li>check that the accessible name is not defined through the <code>title</code> attribute</li><li>for decorative images, check that the alternative text is null</li><li>for complex images, verify that an alternative text is provided by content adjacent to the image</li><li>for audio and video resources, verify that an alternative text is provided by content that is adjacent</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Non-text Content",
		"title": "Check that no image contains text that could be formatted using CSS styling.",
		"ID": "testID-062",
		"IDorigin": "testID-062",
		"wcag": [
			"1.4.5 AA"
		],
		"verifier": "<ul><li>check that image and graphics elements (<code>img</code>, <code>input</code> / <code>object type='image'</code>, <code>embed</code>, <code>canvas</code>) are not used to present text.</li></ul>\n<p>Not applicable if there is no image containing text</p>",
		"exceptions": "<ul><li>SVG (real text),</li><li>special cases (e.g. logo, captcha, tradename)</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Non-text Content",
		"title": "Does every captcha image possess an alternative?",
		"ID": "testID-014",
		"IDorigin": "testID-014",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<p>Check that the accessible name of each captcha image conveys the purpose of the image and not its content (e.g.   'captcha (anti-spam image) ' ).</p>",
		"group": "Captcha",
		"resultatTest": "nt"
	},{
		"themes": "Non-text Content",
		"title": "If a CAPTCHA is used, is there an alternative for visually impaired, blind and hearing impaired users?",
		"ID": "testID-015",
		"IDorigin": "testID-015",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<p>Check that for each captcha which is exclusively visual or audio, one of the following alternatives is provided in addition: </p><ul><li>audio and visual captcha</li><li>logic problems (question for which the response is obvious, simple maths test…)</li><li>there is another method to access the functionality that is protected by the CAPTCHA</li></ul>",
		"group": "Captcha",
		"resultatTest": "nt"
	},{
		"themes": "Non-text Content",
		"title": "Does each occurrence of cryptic content (ASCII art, emoticon, cryptic syntax) have an appropriate alternative?",
		"ID": "testID-016",
		"IDorigin": "testID-016",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<ul><li>check that there is a text alternative provided by a <code>title</code> that is either positioned on the content or provided in text adjacent to the content</li><li>check that the alternative is appropriate</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Non-text Content",
		"title": "Does each frame element possess a title that is relevant?",
		"ID": "testID-065",
		"IDorigin": "testID-065",
		"wcag": [
			"4.1.2 A"
		],
		"verifier": "<p>Check that the value of the <code>title</code> attribute describes the content or the purpose of the <code>iframe</code> or <code>frame</code> element.</p>",
		"exception":"<ul><li>A properly masked non-informative <code>frame</code> or <code>iframe</code> does not need a <code>title</code>. </li> <li >A <code>title</code> is not required if the content of the <code>iframe</code> is not distinct from the surrounding content and does not have a focusable element inside, and there is an added <code>tabindex='- 1'</code> on the <code>iframe</code> so that it does not receive the focus.</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Colors and contrasts",
		"title": "Is there sufficient contrast between the text color and the background color (except for special cases)?",
		"ID": "testID-024",
		"IDorigin": "testID-024",
		"wcag": [
			"1.4.3 AA"
		],
		"verifier": "<ul><li>check that the contrast is sufficient in order that the information communicated by the text can be understood.<ul><li><strong>For normal text:</strong> <ul><li>Font size less than <code>24px</code>: contrast ratio 4.5:1</li><li>Font size greater than or equal to <code>24px</code>: contrast ratio 3:1</li></ul></li><li><strong>For bold text</strong> <ul><li> Font size less than <code>18.5px</code>: contrast ratio 4.5:1</li><li> Font size greater than or equal to <code>18.5px</code>: contrast ratio 3:1</li></ul></li></ul></li><li>For non-underlined links, check that there is sufficient contrast between the body text and the link text</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Colors and contrasts",
		"title": "<ul> <li> If the text color is defined (<code> color </code>), the background color must also be defined (<code> background-color </code>). </li> <li> If the background color is defined (<code> background-color </code>), the text color must be defined too (<code> color </code>). </li> <li> If a background image is used for an element containing text (<code> background-image </code>), the background color must be set (<code> background-color </code>). </li> </ul>",
		"ID": "testID-025",
		"IDorigin": "testID-025",
		"wcag": [
			"1.4.3 AA"
		],
		"verifier": "<h4>More details</h4> <p> These properties can be applied directly to an element or inherited from a parent. To test, the easiest way is to change the default colors of your browser. </p>",
		"complement": "<h4>Additionally: </h4><ul><li>If the <code>color</code> property is not defined, then the <code>background-color</code> is not necessary</li><li>It is possible to change the browser's default background color in order to identify at a glance if background colors are defined for text containers</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Colors and contrasts",
		"title": "Is there sufficient contrast between the colors that are used in the interface components or graphic elements which convey information?",
		"ID": "testID-026",
		"IDorigin": "testID-026",
		"wcag": [
			"1.4.11 AA"
		],
		"verifier": "<p> Check that images of text, as well as graphics, icons and interactive components have a minimum contrast ratio of 3:1 in order to communicate the information</p>",
		"exceptions": "<ul><li>logos</li><li>if text, such as a label or data table, provides the same information as the icon or graphic element</li><li>if the lack of image contrast does not prevent the user from understanding the content or its purpose</li><li>disabled components</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Colors and contrasts",
		"title": "Is the information also conveyed to the user by a means other than colour?",
		"ID": "testID-027",
		"IDorigin": "testID-027",
		"wcag": [
			"1.4.1 A"
		],
		"verifier": "<p>Check that color is not the only means for conveying information:</p><ul><li>information can also be obtained from a text element</li><li>at least one other visual means is available to provide the same information (e.g. icons that are different colors, as well as having different shapes)</li><li>special case of link text: if links are not underlined, they can be identified on keyboard focus and mouse hover by a means other than color</li></ul>\n<p>Not applicable, if no information is conveyed by colour</p>",
		"resultatTest": "nt"
	},{
		"themes": "Colors and contrasts",
		"title": "Is the information also transmitted to the user by a means other than a sensory characteristic?",
		"ID": "testID-051",
		"IDorigin": "testID-051",
		"wcag": [
			"1.3.3 A"
		],
		"verifier": "<p>Check that the information conveyed by using sensory characteristics (shape, size, position, orientation, sound) is also available in text or a message.</p>\n<p>Not applicable, if no information: is conveyed by sound, shape, size or position</p>",
		"resultatTest": "nt"
	},{
		"themes": "Common navigation",
		"title": "Does the accessible name of the interface components contain at a minimum the label visible on the screen (if possible at the start of the accessible name)?",
		"ID": "testID-011",
		"IDorigin": "testID-011",
		"wcag": [
			"2.5.3 A"
		],
		"verifier": "<p>Check that the text of the displayed label (the textual description or the text of the image visible on the screen) is present (at the start, if possible) in the accessible name of this component (to find out more: <a href='https://a11y-guidelines.orange.com/web/a11y-name.html' target='_blank' title='The accessible name in HTML (new window)' aria-label='The accessible name in HTML (new window)'>The accessible name in HTML </a></p>\n<p>Not applicable, if no interface component has a visible label (icon without text, for example)</p>",
		"complement": "<p>For example: for a  'start ' link, use an <code>aria-label</code>  'start playing', but not  'commence playing'</p>",
		"resultatTest": "nt"
	},{
		"themes": "Common navigation",
		"title": "Each link or button label is explicit, at least if the user takes its context into consideration?",
		"ID": "testID-028",
		"IDorigin": "testID-028",
		"wcag": [
			"2.4.4 A"
		],
		"verifier": "<p>The user should be able to determine if they wish to follow a link without having to move around the page to understand what it is.</p><ul><li>check that there are not any identical labels pointing to different locations (URLs)</li><li>check that it is possible to determine the action or destination of a link or button given only its accessible name</li><li>if this is not the case, check that the target of a link or the action of a button may be inferred from its context.</li></ul>",
		"complement": "<h4>Context:</h4><p>Content adjacent to the element, placed just before the link if possible. </p> <p> In addition, the link description should be located: </p><ul><li>in the same phrase</li><li> in the same paragraph (<code>p</code>)</li><li> in the same list element (<code>li</code>)</li><li> in the same table cell (<code>td</code>)</li><li>in the table header cell (<code>th</code>), associated with the cell of the link (<code>td</code>)</li><li>in a heading of a specific level (<code>hn</code>) preceding the link </li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Common navigation",
		"title": "Is there a mechanism to navigate within the page?",
		"ID": "testID-029",
		"IDorigin": "testID-029",
		"wcag": [
			"2.4.1 A"
		],
		"verifier": "<p>If one of the mechanisms below is necessary for navigation, but absent from the page, then the test is non-compliant:</p><ul><li> heading tags (<code>hn</code>)</li><li> bypass blocks or skip links present at the top of the page, which allow the user to go directly to the main content sections </li><li>landmark elements, used to organize the document (<code>header</code>, <code>main</code>…)</li><li> bypass blocks present within the content</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Common navigation",
		"title": "Can the content that appears when focusing on or hovering over an interface component (e.g. tooltip) be controlled by the user?",
		"ID": "testID-030",
		"IDorigin": "testID-030",
		"wcag": [
			"1.4.13 AA"
		],
		"verifier": "<p>Content on hover or focus:</p><ul><li>must be able to dismiss this additional content without moving the focus nor the mouse pointer</li><li>must be able to hover over it with the mouse (without this additional content disappearing)</li><li>it must remain displayed as long as the user does not trigger its closure (by moving the mouse, the focus, <kbd>ESCAPE</kbd> key…) and as long as this content remains valid</li></ul>",
		"exceptions": "<ul><li>Additional content controlled by the user agent, e.g. tooltip generated by the use of a <code>title</code> attribute.</li><li>If the additional content does not mask informative content, the criterion is not applicable</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Common navigation",
		"title": "Are the time limits user-controllable?",
		"ID": "testID-031",
		"IDorigin": "testID-031",
		"wcag": [
			"2.2.1 A"
		],
		"verifier": "<p>Check that one of the conditions below is met:</p><ul><li>user is allowed to turn off the time limit</li><li>the user is allowed to increase the time limit up to 10 times the minimum default value</li><li>the user is warned before time expires and given at least 20 seconds to extend the time limit with a simple action</li></ul>",
		"exceptions": "<ul><li>real-time exception: the time limit is a required part of a real-time event (for example, an auction), and no alternative to the time limit is possible;</li><li>essential exception: the time limit is essential and extending it would invalidate the activity;</li><li>20 hour exception: the time limit is longer than 20 hours.</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Common navigation",
		"title": "Does the user have control over context changes?",
		"ID": "testID-032",
		"IDorigin": "testID-032",
		"wcag": [
			"3.2.1 A",
			"3.2.2 A"
		],
		"verifier": "<p>When using forms or any interactive component, check that there is no change of context witho$ut warning the user:</p><ul><li>when a component receives focus</li><li>when entering data</li><li>when activating a form element other than a button</li></ul>",
		"complement": "<h4>Context changes</h4><p>Major change in the content of the Web page which, when made without the user being aware of it, may confuse users who are unable to view the complete page.</p><p> Changes in context include changes of:</p><ul><li>user agent</li><li>viewport</li><li>focus</li><li>content that changes the meaning of the Web page</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Common navigation",
		"title": "Does the website have at least 2 means of navigation?",
		"ID": "testID-033",
		"IDorigin": "testID-033",
		"wcag": [
			"2.4.5 AA"
		],
		"verifier": "<p>Check that at least 2 of the following mechanisms are present on the page, to allow a user to determine their location on the website:</p> <ul><li>a main navigation menu</li><li>a table of contents</li><li>a sitemap</li><li>a search feature</li></ul>\n<p>when there is less than 3 or 4 pages and/or the content is short, this criterion is not applicable.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Common navigation",
		"title": "Are status messages correctly rendered?",
		"ID": "testID-034",
		"IDorigin": "testID-034",
		"wcag": [
			"4.1.3 A"
		],
		"verifier": "<p>Check that a mechanism based on ARIA roles (<code>status</code>, <code>alert</code>, <code>alertdialog</code>…) or live regions <code>aria-live</code>\nis implemented.</p> <h4>For example</h4><ul><li> message that provides information on the results of an action or the state of the application: <code>role='status'</code></li><li>error message: <code>role='alert'</code></li><li> message indicating progress: <code>role='log'</code>, <code>'progressbar'</code> or <code>'status'</code></li></ul><p>For more information: <a href=\"https://a11y-guidelines.orange.com/web/aria-status.html#utiliser-abbr-aria-abbr-les-messages-d-tat-de-statut-ou-contextuel\" target=\"_blank\" title=\"Status messages (new window)\"> status messages</a>.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Common navigation",
		"title": "For any moving, scrolling, blinking information that lasts more than five seconds or updated content, start automatically , is there a mechanism for the user to pause, stop, or hide it?",
		"ID": "testID-035",
		"IDorigin": "testID-035",
		"wcag": [
			"2.2.2 A"
		],
		"verifier": "<p>Not applicable, if no movement, scrolling or flashing lasts more than 5 seconds or does not start automatically or if updates also start automatically</p>",
		"resultatTest": "nt"
	},{
		"themes": "Common navigation",
		"title": "There should be no blinking or flashing at speeds of 3 per second or more in an area equal to or greater than <code>21 824 px²</code>.",
		"ID": "testID-036",
		"IDorigin": "testID-036",
		"wcag": [
			"2.3.1 A"
		],
		"verifier": "<p> Not applicable, if the flashes flash less than 3 times per second or on an area of less than <code> 21 824 px² </code> </p>",
		"resultatTest": "nt"
	},{
		"themes": "Keyboard navigation",
		"title": "Is all functionality of the page content operable through a keyboard interface?",
		"ID": "testID-037",
		"IDorigin": "testID-037",
		"wcag": [
			"2.1.1 A"
		],
		"verifier": "<ul><li> check that the functionalities available by using the mouse can also be accessed using only the keyboard </li><li> check that the content displayed on hover (e.g. popin, tooltip) is also displayed when focus is received </li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Keyboard navigation",
		"title": "The page does not contain keyboard traps?",
		"ID": "testID-038",
		"IDorigin": "testID-038",
		"wcag": [
			"2.1.2 A"
		],
		"resultatTest": "nt"
	},{
		"themes": "Keyboard navigation",
		"title": "If a keyboard shortcut using a single key is available, does it meet one of the conditions below?",
		"ID": "testID-039",
		"IDorigin": "testID-039",
		"wcag": [
			"2.1.4 A"
		],
		"verifier": "<ul><li> the shortcut can be disabled by the user </li><li>the shortcut is only active when the interface component has focus </li><li> A mechanism is available to remap the shortcut to include one or more non-printable keyboard keys (<kbd>Ctrl</kbd>, <kbd>Alt</kbd>…) </li></ul>",
		"exceptions": "<p>Keyboard shortcuts that include a modifier key and accesskeys (<code> accesskey </code>) are not affected.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Keyboard navigation",
		"title": "Is the order in which focusable components receive focus logical and consistent?",
		"ID": "testID-040",
		"IDorigin": "testID-040",
		"wcag": [
			"2.4.3 A"
		],
		"verifier": "Check that the focus order of the elements (buttons, links, form fields) is consistent and logical (usually equivalent to the visual order).",
		"resultatTest": "nt"
	},{
		"themes": "Keyboard navigation",
		"title": "When focus is received, is there a visible focus indicator?",
		"ID": "testID-041",
		"IDorigin": "testID-041",
		"wcag": [
			"2.4.7 AA"
		],
		"verifier": "<p>Check that the default browser style is preserved or that a custom focus is applied.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Layout",
		"title": "Does the text remain readable when the character size is increased up to 200%?",
		"ID": "testID-042",
		"IDorigin": "testID-042",
		"wcag": [
			"1.4.4 AA"
		],
		"verifier": "<p>Check that there is no loss of information (no unusable, truncated, or hidden content or functionalities) after enlarging the text size by up to 200%.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Layout",
		"title": "Is the horizontal scroll bar always absent for a browser window that has been reduced to a width of 320px?",
		"ID": "testID-043",
		"IDorigin": "testID-043",
		"wcag": [
			"1.4.10 AA"
		],
		"verifier": "<p>Check that a horizontal scroll bar does not appear.</p>",
		"exceptions": "Certain specific types of content, such as maps, data tables, games, etc. may require two dimensional scrolling.",
		"resultatTest": "nt"
	},{
		"themes": "Layout",
		"title": "Can the user override text spacing properties without loss of content or functionality?",
		"ID": "testID-044",
		"IDorigin": "testID-044",
		"wcag": [
			"1.4.12 AA"
		],
		"verifier": "<ul><li>line height must be adjustable to at least 1.5 times the font size </li><li>spacing following paragraphs must be adjustable to at least 2 times the font size </li><li>letter spacing must be adjustable to at least 0.12 times the font size</li><li>word spacing must be adjustable to at least 0.16 times the font size </li><li>absence of truncated or superimposed text</li></ul>",
		"complement": "<p>The following bookmarklet can be used to facilitate this test (add to your favorites bar) <a href='javascript:(function(){document.querySelector(%27body%27).classList.add(%27text-spacing%27);%20var%20style%20=%20document.createElement(%27style%27),%20styleContent%20=%20document.createTextNode(%27.text-spacing%20*%20{%20line-height:%201.5%20!important;%20letter-spacing:%200.12em%20!important;%20word-spacing:%200.16em%20!important;%20}%20.text-spacing%20p{%20margin-bottom:%202em%20!important;%20}%20%27);%20style.appendChild(styleContent%20);%20var%20caput%20=%20document.getElementsByTagName(%27head%27);%20caput[0].appendChild(style);%20})();'>Text spacing</a></p>",
		"resultatTest": "nt"
	},{
		"themes": "Layout",
		"title": "Do elements that are repeated on other Web pages of the website (navigation mechanisms, components, groupings) occur in the same relative order?",
		"ID": "testID-045",
		"IDorigin": "testID-045",
		"wcag": [
			"3.2.3 AA"
		],
		"verifier": "<p>Check that the navigation mechanisms are always located in the same position on each Web page of the website (on the screen and in the code). </p>",
		"resultatTest": "nt"
	},{
		"themes": "Layout",
		"title": "Are the labels of the interactive components consistent with respect to the other Web pages of the website?",
		"ID": "testID-046",
		"IDorigin": "testID-046",
		"wcag": [
			"3.2.4 AA"
		],
		"verifier": "<p>Check that components that have the same function have identical names (identical accessible name, or at least a common dynamic verb) from one page to another and within the same page if a component is repeated.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Layout",
		"title": "Is the content still understandable after disabling CSS?",
		"ID": "testID-058",
		"IDorigin": "testID-058",
		"wcag": [
			"1.3.2 A"
		],
		"verifier": "<p>Check that when the content is read in a linear order, it remains understandable (reading order in the page without CSS).</p>",
		"complement": "<h4>More details</h4><p>The content order in the HTML code must be understandable, often, it is identical to the layout order of the content on the screen.</p><p>Examples of content to test:</p><ul><li>Layout with css <ul><li>Positioning properties (<code>top</code>, <code>left</code>…)</li><li><code>Float</code> in particular <code>right</code></li><li><code>Display:flex</code> or <code>display:grid</code></li></ul></li><li>Layout table</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Layout",
		"title": "Is the informative content is still present after disabling CSS?",
		"ID": "testID-060",
		"IDorigin": "testID-060",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<p>Check that no information is lost</p>",
		"complement": "<h4>More details</h4><ul><li>No information must be provided by CSS generated content (example: pseudo classes<code> ::before / :before</code> and <code>::after / :after</code>, <code>content</code> property , background CSS images </li><li>CSS generated content must only provide decorative informations</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Layout",
		"title": "Are changes in the reading order indicated?",
		"ID": "testID-059",
		"IDorigin": "testID-059",
		"wcag": [
			"1.3.2 A"
		],
		"verifier": "<p>Check that the <code>dir='rtl'</code> or <code>dir='ltr'</code> attributes are applied when necessary.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Touch and interactions",
		"title": "Do multipoint or path-based gestures have an alternative that can be operated with a single pointer without a path-based gesture? ",
		"ID": "testID-047",
		"IDorigin": "testID-047",
		"wcag": [
			"2.5.1 A"
		],
		"verifier": "<p>Check that for any multipoint gesture (requiring several fingers) and / or requiring path-based gestures, an alternative is available that requires only a single pointer (a single finger) and without a path-based gesture.</p>",
		"complement": "<h4>For example</h4><p><strong> Zoom functionality on a map: </strong>(+ / -) buttons are available, as an alternative to a two-finger pinch.</p>",
		"group": "Touche Screen",
		"resultatTest": "nt"
	},{
		"themes": "Touch and interactions",
		"title": "Can click (or touch) errors be cancelled?",
		"ID": "testID-048",
		"IDorigin": "testID-048",
		"wcag": [
			"2.5.2 A"
		],
		"verifier": "<p>It must be possible to cancel actions triggered by a single pointer input that operates with one point of contact with the screen (e.g. single taps and clicks, double-taps and clicks):</p><ul><li>check that no action is triggered on the down-event (as soon as you touch or press an element) and that it is possible to abort the action by lifting the pointer outside that element.</li><li> if an action is triggered when an element is pressed, check that it is cancelled as soon as the pointer is released.</li><li>for complex actions (e.g. drag and drop), check that the user can cancel the action before completing the process through, for example, a confirmation dialog.</li></ul>",
		"exceptions": "<p>Interactions that emulate a keyboard or a numeric keypad are allowed to implement actions on down-events.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Touch and interactions",
		"title": "Is there an alternative for actions triggered by device motion or user motion?",
		"ID": "testID-049",
		"IDorigin": "testID-049",
		"wcag": [
			"2.5.4 A"
		],
		"verifier": "<ul><li>check that these actions can also be operated by user interface components (e.g. button)</li><li>check that it is possible to disable the motion detection</li></ul>",
		"exceptions": "<p>The motion is essential for the function (e.g. pedometer)</p>",
		"group": "Touche Screen",
		"resultatTest": "nt"
	},{
		"themes": "Touch and interactions",
		"title": "Is the content displayed regardless of the screen orientation (portrait or landscape)?",
		"ID": "testID-050",
		"IDorigin": "testID-050",
		"wcag": [
			"1.3.4 AA"
		],
		"verifier": "<p>Check that the content and functionalities are available in both orientations (no loss of information, no truncated elements).</p>",
		"group": "Touche Screen",
		"resultatTest": "nt"
	},{
		"themes": "Multimedia",
		"title": "For pre-recorded audio-only media: is an equivalent text transcript provided?",
		"ID": "testID-052",
		"IDorigin": "testID-052",
		"wcag": [
			"1.2.1 A"
		],
		"verifier": "<p>Check that a complete transcript (text containing all the auditory information) is provided as plain text or HTML.<br> This text transcript should be:</p><ul><li>present in the page</li> <li>or available via a link immediately next to the link to the audio clip</li></ul>",
		"group": "Multimedia",
		"resultatTest": "nt"
	},{
		"themes": "Multimedia",
		"title": "Pre-recorded video-only media without audio: is a text transcript or an audio track that presents equivalent information provided?",
		"ID": "testID-053",
		"IDorigin": "testID-053",
		"wcag": [
			"1.2.1 A"
		],
		"verifier": "<p>Check that a complete transcript (text that provides an equivalent to what is presented visually) is provided as plain text or HTML.<br> This text transcript should be: </p><ul><li> present in the page </li> <li> or available via a link immediately next to the link to the video clip</li></ul> ",
		"group": "Multimedia",
		"resultatTest": "nt"
	},{
		"themes": "Multimedia",
		"title": "Pre-recorded video (with or without audio): is a text transcript or an audio description provided?",
		"ID": "testID-055",
		"IDorigin": "testID-055",
		"wcag": [
			"1.2.3 A"
		],
		"verifier": "<ul><li>Check that a complete transcript (all of the information - both visual and auditory - in text form) is provided as plain text or HTML.<br> This text transcript should be:<ul><li> present in the page </li> <li> or available via a link immediately next to the link to the video clip</li></ul></li><li>Or for all video content, check that an audio description is provided:<ul><li> check that the audio description is synchronized correctly </li><li> check that the audio description does not conflict with the audio track of the video (no loss of information)</li><li> check that the audio description is appropriate</li></ul>",
		"group": "Multimedia",
		"resultatTest": "nt"
	},{
		"themes": "Multimedia",
		"title": "Pre-recorded video (with or without audio): is an audio description provided?",
		"ID": "testID-057",
		"IDorigin": "testID-057",
		"wcag": [
			"1.2.5 AA"
		],
		"verifier": "<ul><li>check that an audio description is provided for all video content</li><li>check that the audio description is synchronized correctly</li><li>check that the audio description does not conflict with the audio track of the video (no loss of information)</li><li>check that the audio description is appropriate</li></ul>",
		"group": "Multimedia",
		"resultatTest": "nt"
	},{
		"themes": "Multimedia",
		"title": "Pre-recorded video with audio: are captions provided for all the content?",
		"ID": "testID-054",
		"IDorigin": "testID-054",
		"wcag": [
			"1.2.2 A"
		],
		"verifier": "<ul><li>check that captions are available for all video with audio content</li><li>check that the captions are relevant (providing all of the information needed to understand the content, such as the identity of the speakers)</li><li>check that the captions are not covering important information in the video</li></ul>",
		"group": "Multimedia",
		"resultatTest": "nt"
	},{
		"themes": "Multimedia",
		"title": "Live video content with audio: are captions provided for all the content?",
		"ID": "testID-056",
		"IDorigin": "testID-056",
		"wcag": [
			"1.2.4 AA"
		],
		"verifier": "<ul><li>check that captions are available</li><li>check that the captions are relevant (providing all of the information needed to understand the content, such as the identity of the speakers)</li></ul>",
		"complement": "<h4>Captions</h4><p>The captions convey not only the content of spoken dialogue, but also equivalents for non-dialogue audio information needed to understand the program content, including sound effects, music, laughter, speaker identification and location.</p>",
		"group": "Multimedia",
		"resultatTest": "nt"
	},{
		"themes": "Multimedia",
		"title": "If any audio plays automatically for more than 3 seconds, does the user have a mechanism to control it?",
		"ID": "testID-063",
		"IDorigin": "testID-063",
		"wcag": [
			"1.4.2 A"
		],
		"verifier": "<ul><li>possible to pause or stop the sound</li><li>possible to control audio volume independently from the overall system volume level</li></ul>",
		"group": "Multimedia",
		"resultatTest": "nt"
	},{
		"themes": " Assistive technology",
		"title": "Are all user interface components (native or custom controls) compatible with assistive technologies?",
		"ID": "testID-066",
		"IDorigin": "testID-066",
		"wcag": [
			"4.1.2 A"
		],
		"verifier": "<p> Check all standard components (e.g. form elements) as well as those components developed using JavaScript (e.g. drop-down menu): </p><ul><li> each custom component uses an appropriate ARIA role (refer to the component's design pattern in order to validate this)</li><li> for components for which the user can change the value or state, these properties can also be defined via assistive technologies (e.g. check or uncheck a checkbox)</li><li> every time the state changes, the user is notified via their assistive technology (example of this test passed: screen reader notification: 'checked' or 'unchecked')</li></ul>",
		"resultatTest": "nt"
	}
]}
