{
	"testWebID-0": [
		{
			"title" : "Titre de page non renseigné",
			"detail" : "Chaque page doit posséder un titre unique.",
			"solution" : "Renseigner l'élément <title>, avec des mots clefs permettant de comprendre le rôle de la page. Les informations peuvent être ordonnées de la  plus spécifique vers la moins spécifique, ou inversement (pas de règles).",
			"technicalSolution" : "<title>Acccueil - Espace client Orange</title>"
		},
		{
			"title" : "Titre de page non pertinent",
			"detail" : "Chaque page doit posséder un titre unique, permettant de comprendre le rôle de celle-ci.",
			"solution" : "Renseigner l'élément <title>, avec des mots clefs permettant de comprendre le rôle de la page. Les informations peuvent être ordonnées de la  plus spécifique vers la moins spécifique, ou inversement (pas de règles).",
			"technicalSolution" : "<title>Acccueil - Espace client Orange</title>"
		}
		
	],
	"testWebID-1": [
		{
			"title" : "Hiérarchisation imcompléte",
			"detail" : "La page doit être structurée à partir de titres de niveaux.",
			"solution" : "Tous les contenus, traités visuellement comme des titres, doivent posséder une sémantique de titre (balises <h1> à <h6>)",
			"technicalSolution" : ""
		},
		{
			"title" : "Hiérarchisation des niveaux de titres non logique",
			"detail" : "Les titres de niveaux doivent être structurés de manière logique",
			"solution" : "",
			"technicalSolution" : ""
		}
		
	],
	"testWebID-2": [
		{
				"title" : "Absence de sémantique de liste HTML",
				"detail" : "Les éléments présentés visuellement comme des listes doivent être structurés avec une sémantique de liste.",
				"solution" : "Utiliser des sémantiques de listes appropriées <ul>, <ol> ou <dl>, <dt> et <dd>",
				"technicalSolution" : ""
		},
		{
				"title" : "Absence de sémantique de lien HTML ",
				"detail" : "Les éléments interactifs entrainant un changement d'URL doivent utiliser une sémantique de lien HTML. ",
				"solution" : "Utiliser la sémantique <a> avec un attribut href.",
				"technicalSolution" : ""
		},
		{
				"title" : "Absence de sémantique de bouton HTML ",
				"detail" : "Les éléments interactifs déclanchant une action doivent utiliser une sémantique de bouton HTML. ",
				"solution" : "Utiliser la sémantique <button> ou <input type=\"button\"> ",
				"technicalSolution" : ""
		}
	],
	"testWebID-3": [
		{
			"title" : "Element incomplet",
			"detail" : "Des balises de début ou de fin sont manquantes pour un ou plusieurs éléments.",
			"solution" : "",
			"technicalSolution" : ""
		
		},
		{
			"title" : "Erreur d'imbrication",
			"detail" : "Des éléments ne respectent pas les règles d'imbrications (conformité HTML).",
			"solution" : "",
			"technicalSolution" : ""
		
		},
		{
			"title" : "Attributs dupliqués",
			"detail" : "Présence d'attributs dupliqués sur un même élément.",
			"solution" : "",
			"technicalSolution" : ""
		
		},
		{
			"title" : "Présence d'ID dupliqués",
			"detail" : "La page ne doit pas comporter des ID dupliqués.",
			"solution" : "",
			"technicalSolution" : ""
		}
		
	],
	"testWebID-4": [
		{
			"title" : "Absence d'attribut lang",
			"detail" : "Un attribut lang doit être présent sur l'élément HTML. De plus la valeur de l'attribut doit correspondre à la langue principale du document.",
			"solution" : "",
			"technicalSolution" : "<html lang=\"fr\" >"
		},
		{
			"title" : "La valeur de l'attribut lang est erronée",
			"detail" : "La valeur de l'attribut doit correspondre à la langue principale du document.",
			"solution" : "Si la langue principale du document est l'anglais, la valeur de l'attribut sera lang=\"en\"",
			"technicalSolution" : "<html lang=\"en\" >"
		}
	],
	"testWebID-5": [
		{
			"title" : "Changement de langue non indiqué",
			"detail" : "Les mots et expressions en langue étrangère doivent être indiqués aux utilisateurs.",
			"solution" : "Ajouter un attribut lang aux termes en langue étrangère",
			"technicalSolution" : "<q lang=\"en\">[…]</q>"
		}
	],
	"testWebID-6": [
		{
			"title" : "Absence de sémantiques d'entêtes de ligne ou de colonne",
			"detail" : "Les entêtes sont obligatoires pour identifier la nature des colonnes et/ou des lignes",
			"solution" : "Les cellules d'entêtes de colonnes doivent posséder une sémantique de TH + un attribut scope=\"col\". Les cellules d'entêtes de lignes doivent posséder une sémantique de TH + un attribut scope=\"row\". ",
			"technicalSolution" : "<th scope=\"col\"> / <th scope=\"row\"> "
		},
		{
			"title" : "Présence de tableau de mise en forme",
			"detail" : "Les tableaux ne doivent pas être utilisés pour de la mise en forme",
			"solution" : "Ajouter un role=\"presentation\" au tableau",
			"technicalSolution" : "<table role=\"presentation\">"
		}
	],
	"testWebID-7": [
		{
			"title" : "Absence de ALT sur des images",
			"detail" : "Toutes les images doivent posséder un attribut ALT.",
			"solution" : "Ajouter un attribut ALT aux images.",
			"technicalSolution" : "<img alt=\"[...]\" [...]> "
		},
		{
			"title" : "Absence de TITLE sur les cadres",
			"detail" : "Tous les cadres doivent posséder un attribut TITLE.",
			"solution" : "Ajouter un attribut TITLE aux cadres.",
			"technicalSolution" : "<iframe title=\"[...]\">"
		}
	],
	"testWebID-8": [
		{
			"title" : "Une image porteuse d'information est intégrée en background (CSS)",
			"detail" : "Les images intégrées par du CSS ne doivent pas porter d'information.",
			"solution" : "Les images portant de l'information doivent être intégrées dans le HTML.",
			"technicalSolution" : ""
		}
	],
	"testWebID-9": [
		{
			"title" : "Le ALT d'une image-lien n'est pas renseigné ou non pertinent",
			"detail" : "Le contenu de l'attribut alt de chaque image-lien est pertinent par rapport à sa fonction de lien.",
			"solution" : "Renseigner la cible du lien dans le ALT.",
			"technicalSolution" : "<a href=\"http://monsite.com\"> <img src=\"[...]\" alt= \"Mon site\" > </a>"
		},
		{
			"title" : "Le ALT d'une image porteuse d'information n'est pas renseigné ou non pertinent",
			"detail" : "L'attribut alt de chaque image est pertinent par rapport au rôle de l'image dans la page.",
			"solution" : "Renseigner dans le ALT, l'information portée par l'image.",
			"technicalSolution" : ""
		},
		{
			"title" : "Le ALT d'une image contenant du texte n'est pas renseigné ou non pertinent",
			"detail" : "L'attribut alt reprend au moins le texte de l’image.",
			"solution" : "Reporter  dans la ALT le texte présenté par l'image.",
			"technicalSolution" : ""
		},
		{
			"title" : "Le ALT d'une image décorative n'est pas pertinent",
			"detail" : "L'attribut alt d'une image décorative doit être vide, afin que l'image soit ignorée, notamment par les aides techniques.",
			"solution" : "Renseigner un alt vide.",
			"technicalSolution" : "<img src=\"[...]\" alt=\"\" >"
		},
		{
			"title" : "Le ALT d'une image complexe (schémas, graphes ...) n'est pas pertinent",
			"detail" : "",
			"solution" : "Pour toute description d'image trop longue pour être mise dans un attribut alt, la description de l'image sous forme de texte html est, soit présente dans la page, soit, un lien pointe vers une page html contenant la description, et ceci, à proximité de l'image à décrire.",
			"technicalSolution" : ""
		}
	],
	"testWebID-10": [
		{
			"title" : "Attribut TITLE non pertinent",
			"detail" : "La valeur de l'attribut doit permettre aux utilisateurs de comprendre la nature de la frame ou iframe.",
			"solution" : "Ajouter un attribut TITLE, la valeur de l'attribut décrit le contenu de la frame ou iframe.",
			"technicalSolution" : ""
		}
		
	],
	"testWebID-11": [
		{
			"title" : "Présence de texte sous forme d'image",
			"detail" : "Les textes doivent être présent dans le HTML et mis en forme via CSS.",
			"solution" : "Intégrer les textes dans le HTML et gérer la mise en forme via CSS.",
			"technicalSolution" : ""
		}
	],
	"testWebID-12": [
		{
			"title" : "Absence de transcrit complet",
			"detail" : "Un transcrit complet (texte contenant l'ensemble des informations visuelles et auditives) doit être proposé en alternative aux pistes audios ou vidéos. ",
			"solution" : "Ajouter un transcrit complet sous forme de texte html, soit directement dans la page, soit par un lien pointant vers une page html contenant ce transcrit et ceci, à proximité de l'élément à décrire.",
			"technicalSolution" : ""
		},
		{
			"title" : "Absence de sous-titres",
			"detail" : "Pour toute vidéo, des sous-titres sont disponibles.",
			"solution" : "Ajouter des sous-titres sous formats texte pour toutes vidéos. Ceux-ci restituent l’ensemble des informations de la piste audio.",
			"technicalSolution" : ""
		},
		{
			"title" : "Absence d'audiodescription",
			"detail" : "Une audiodescription est nécessaire pour les vidéos présentant des informations sous forme visuelle.",
			"solution" : "Ajouter une audio-description est présente en complément de la bande audio, si besoin. Celle-ci présente, sous format texte, les informations convoyées uniquement par l’image.",
			"technicalSolution" : ""
		}
	],
	"testWebID-13": [
		{
			"title" : "Impossible de stopper une piste audio ou vidéo",
			"detail" : "Les pistes audio de la page automatiquement jouées plus de 3 secondes peuvent être stoppées, mises en pause ou leur volume peut être contrôlé indépendamment.",
			"solution" : "Fournir un mécanisme accessible, permettant aux utilisateurs de contrôler les sons joués plus de 3 secondes.",
			"technicalSolution" : ""
		}
	],
	"testWebID-14": [
		{
			"title" : "Présence de clignotements rapides",
			"detail" : "Présence de contenu présentant des clignotements rapides (plus de 3 flash à la seconde) ou les flashs sont inférieurs au seuil général ou seuil de rouge.",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testWebID-15": [
		{
			"title" : "Absence d'alternative au captcha",
			"detail" : "Tout captcha uniquement visuel ou sonore doit posséder une alternative accessible.",
			"solution" : "Proposer en alternative : un captcha audio + visuel, ou  des tests logiques (question dont la réponse est évidente, test mathématique simple…).",
			"technicalSolution" : ""
		}
	],
	"testWebID-16": [
		{
			"title" : "Contraste insuffisant entre texte et fond",
			"detail" : "Le contraste doit être suffisant pour comprendre l'information portée par tous les textes.",
			"solution" : "Assurer un contraste de 4.5:1 minimum pour les textes de tailles normales (infèrieur à 24px CSS et 19px CSS en gras). Assurer un contraste de 3:1 minimum pour les textes de grandes tailles (supérieur à 24px CSS et 19px CSS en gras).",
			"technicalSolution" : ""
		},
		{
			"title" : "Contraste insuffisant pour des liens non-soulignés",
			"detail" : "Les liens non-soulignés doivent avoir un rapport de contraste suffisant avec le texte environnant.",
			"solution" : "Assurer un contraste de 4.5:1 minimum entre un lien non-souligné et le texte environnant de tailles normales (infèrieur à 24px CSS et 19px CSS en gras). Assurer un contraste de 3:1 minimum entre un lien non-souligné et le texte environnant de grandes tailles (supérieur à 24px CSS et 19px CSS en gras).",
			"technicalSolution" : ""
		}
	],
	"testWebID-17": [
		{
			"title" : "Contraste insuffisant pour des icônes porteur d'information",
			"detail" : "Le contraste doit être suffisant pour transmettre l'information.",
			"solution" : "Assurer un contraste de 3:1 minimum pour les icônes.",
			"technicalSolution" : ""
		},
		{
			"title" : "Contraste insuffisant pour des composants interactifs (boutons, boutons radios, ...)",
			"detail" : "Le contraste doit être suffisant pour transmettre l'information.",
			"solution" : "Assurer un contraste de 3:1 minimum pour les différents états de composants interactifs.",
			"technicalSolution" : ""
		},
		{
			"title" : "Contraste insuffisant pour états de composants interactifs (focus, hover, ...)",
			"detail" : "Le contraste doit être suffisant pour transmettre l'information.",
			"solution" : "Assurer un contraste de 3:1 minimum pour les différents états de composants interactifs.",
			"technicalSolution" : ""
		}
	],
	"testWebID-18": [
		{
			"title" : "La couleur est le seul moyen de convoyer de l'information",
			"detail" : "La couleur ne doit pas être le seul moyen de convoyer d'information : au moins un autre moyen visuel est disponible pour obtenir la même information.",
			"solution" : "Compléter la couleur par un texte explicite, ou une autre information visuelle (exemple : des icônes utilisent des couleurs, mais également des formes différentes).",
			"technicalSolution" : ""
		}
	],
	"testWebID-19": [
		{
			"title" : "Lien non identifiable dans un corps de texte",
			"detail" : "Les liens dans le corps du texte doivent être facilement identifiables visuellement par un moyen autre que la couleur (souligné, gras, etc.).",
			"solution" : "Appliquer un moyen visuellement identifiable (souligné, gras, etc.).  s'assurer d'un contraste de 3:1 entre le texte, le fond et les liens et qu'il existe un autre moyen que la couleur pour les identifier au survol et au focus.",
			"technicalSolution" : ""
		}
	],
	"testWebID-20": [
		{
			"title" : "Une information sensorielle est le seul moyen de convoyer de l'information",
			"detail" : "Une l’information sensorielle (ex : position, taille, son) ne doit pas être le seul moyen pour transmettre de l'information.",
			"solution" : "Compléter linformation par un texte, ou un message explicite.",
			"technicalSolution" : ""
		}
	],
	"testWebID-22": [
		{
			"title" : "Présence de libellés identiques",
			"detail" : "Des éléments interactifs avec des libellés identiques mais des cibles différentes, sont présents dans la page.",
			"solution" : "Ajouter une information discriminante à chaque libellé afin de les différencier.",
			"technicalSolution" : "Plusieurs solutions sont possibles pour compléter un libellé de lien ou de bouton : sr-only, aria-labelledby, aria-label."
		}
	],
	"testWebID-23": [
		{
			"title" : "Présence de libellés non-compréhensibles dans leur contexte",
			"detail" : "La cible d'un lien ou l'action portée par un bouton n'est pas compréhensible grâce à son contexte direct (texte environnant).",
			"solution" : "Ajouter une information discriminante dans le texte environnant.",
			"technicalSolution" : "La solution dépend du contexte d'utilisation de l'élément : \n- élément dans un paragraphe : compléter le texte du paragraphe (<p>[...]</p>) \n- élément dans une liste : compléter un item de la liste (<ul>, <ol>) \n- élément dans une cellule de tableau : compléter le texte de la cellule (<td>[...]</td>) ou compléter l'entête directe de la cellule (<th>[...]</th>)."
		}
	],
	"testWebID-24": [
		{
			"title" : "Présence de libellés identiques",
			"detail" : "Des éléments interactifs avec des libellés identiques, mais des cibles différentes sont présents dans la page.",
			"solution" : "Ajouter une information discriminante à chaque libellé afin de les différencier.",
			"technicalSolution" : "Plusieurs solutions sont possibles pour compléter un libellé de lien ou de bouton : sr-only, aria-labelledby, aria-label"
		}
	],
	"testWebID-25": [
		{
			"title" : "Absence du texte visible à l'écran, dans l'accessible name",
			"detail" : "Le texte de l'étiquette affichée (le libellé textuel ou le texte de l'image visible à l'écran) doit être présent (en premier, si possible) dans le nom (accessible) de ce composant.",
			"solution" : "Modifier l'accessible name de l'élément afin d'intégrer le texte visible à l'écran, si possible en premier.",
			"technicalSolution" : "Plusieurs solutions sont possibles pour redéfinir l'accessible name : aria-labelledby, aria-label, title, sr-only."
		}
	],
	"testWebID-26": [
		{
			"title" : "Le libellé du lien n'est pas compréhensible",
			"detail" : "Le libellé est basé sur le nom du fichier.",
			"solution" : "Le libellé texte doit être basé sur le titre du document.",
			"technicalSolution" : ""
		},
		{
			"title" : "Absence du format du document",
			"detail" : "Le format du document n'est pas précisé dans le libellé du lien.",
			"solution" : "Ajouter le format du fichier dans le libellé texte du lien.",
			"technicalSolution" : ""
		},
		{
			"title" : "Absence de la langue du document",
			"detail" : "Le document en téléchargement est dans une langue différente de la page courante.",
			"solution" : "Préciser la langue du document en téléchargement dans le libellé texte du lien.",
			"technicalSolution" : ""
		},
		{
			"title" : "Absence du poids du document",
			"detail" : "Le poids du document n'est pas précisé.",
			"solution" : "Préciser le poids du document en téléchargement dans le libellé texte du lien.",
			"technicalSolution" : ""
		}
	],
	"testWebID-27": [
		{
			"title" : "Absence de la mention \"nouvelle fenêtre\"",
			"detail" : "L'ouverture dans une nouvelle fenêtre n'est pas annoncé aux utilisateurs.",
			"solution" : "Ajouter la mention \"nouvelle fenêtre\" au lien.",
			"technicalSolution" : "- Ajouter la mention dans un attribut \"title\" positionné sur le lien. \n- L'attribut reprend la libellé texte visible à l'écran, suivi de la mention \"(nouvelle fenêtre)\". \n- Afin d'améliorer la robustesse de la solution pour les utilisateurs de lecteurs d'écran, l'attribut \"title\" est doublé par un attribut \"aria-label\" positionné également sur le lien. \n- L'attribut \"aria-label\" reprend les mêmes informations que le title."
		}
	],
	"testWebID-28": [
		{
			"title" : "Absence de région \"main\"",
			"detail" : "La page doit contenir à minima une région \"main\".",
			"solution" : "Le contenu principal doit être encapsulé dans une région \"main\".",
			"technicalSolution" : "- Le contenu principal doit être encapsulé dans une région \"main\". \n- La région \"main\" ne doit pas contenir d'élément répété ailleurs dans la page (ex : navigation)."
		}
	],
	"testWebID-29": [
		{
			"title" : "Absence de liens d'évitement",
			"detail" : "Des liens d'évitements sont nécessaires afin d'accéder aux principales zones de la pages (menu principal, contenu principal, moteur de recherche, etc...",
			"solution" : "Ajouter des liens d'évitements, en début de page. Ce sont les premiers éléments de la page. Les liens peuvent être masqués (de manière accessible, cf. masquage accessible) seulement si contrainte forte. Ils s'affichent alors uniquement dès la prise de focus clavier.",
			"technicalSolution" : ""
		}
	],
	"testWebID-30": [
		{
			"title" : "Formulaire soumis automatiquement lors de la prise de focus d'un élément",
			"detail" : "Un formulaire est soumis automatiquement dès la prise de focus d'un élément du formulaire (onFocus).",
			"solution" : "Un formulaire doit être soumis uniquement après activation du bouton de soumission (onClick).",
			"technicalSolution" : ""
		},{
			"title" : "Formulaire soumis automatiquement lors de la saisie de données",
			"detail" : "Un formulaire est soumis automatiquement après saisie de données dans un champ (onInput).",
			"solution" : "Un formulaire doit être soumis uniquement après activation du bouton de soumission (onClick).",
			"technicalSolution" : ""
		},{
			"title" : "Changement du contenu de la page courante dès la prise de focus",
			"detail" : "Un changement de contenu s'opère sans qu'il soit initié volontairement par l'utilisateur (onFocus).",
			"solution" : "Un changement de contenu doit s'opèrer uniquement après déclenchement volontaire de l'utilisateur (onClick) sur un lien ou un bouton d'action.",
			"technicalSolution" : ""
		},{
			"title" : "Ouverture d'une nouvelle page dès la prise de focus",
			"detail" : "Un changement de page s'opère sans qu'il soit initié volontairement par l'utilisateur (onFocus).",
			"solution" : "Un changement de contenu doit s'opèrer uniquement après déclenchement volontaire de l'utilisateur (onClick) sur un lien.",
			"technicalSolution" : ""
		}
	],
	"testWebID-31": [
		{
			"title" : "Déplacement du pointeur vers le contenu d'une tooltip impossible",
			"detail" : "Après ouverture d'une tooltip, l'utilisateur ne peut pas déplacer son pointeur de l'élément déclencheur vers le contenu de la tooltip, sans que celle-ci se ferme.",
			"solution" : "L'utilisateur doit être capable de déplacer le pointeur souris de l'élément déclencheur vers le contenu de la tooltip sans fermeture de celle-ci.",
			"technicalSolution" : ""
		}, {
			"title" : "Impossible de fermer un contenu additionnel (tooltip, popin, etc...) sans déplacer le focus ou le pointeur",
			"detail" : "Après ouverture du contenu additionnel, l'utilisateur ne peut pas fermer celui-ci sans avoir à déplacer le focus ou le pointeur de la souris.",
			"solution" : "Proposer un mécanisme aux utilisateurs pour leur permettre de fermer un contenu additionnel sans déplacement de focus ou de souris (ex : fermeture depuis la touche Echap).",
			"technicalSolution" : ""
		}
	],
	"testWebID-32": [
		{
			"title" : "L'utilisateur n'a pas le contrôle d'une limite de temps",
			"detail" : "Une limite de temps est présente pour réaliser une action, hors l'utilisateur n'a pas le contrôle de celle-ci.",
			"solution" : "L'utilisateur doit pouvoir supprimer la limite ou l'ajuster.",
			"technicalSolution" : ""
		}
	],
	"testWebID-33": [
		{
			"title" : "L'utilisateur n'a pas le contrôle d'un raccourci clavier basé sur une seule touche",
			"detail" : "L'utilisateur n'a pas le contrôle d'un raccourci clavier basé sur une seule touche : letter (minuscule ou majuscule), ponctuation, chiffre, ou symbôle.",
			"solution" : "L'utilisateur doit pouvoir : \n- désactiver le raccourci \n- ou modifier le raccourci pour ajouter une touche supplémentaire à la combinaison \n ou s'assurer que le raccourci est actif uniquement lors de la prise de focus du composant de l'interface.",
			"technicalSolution" : ""
		}
	],
	"testWebID-34": [
		{
			"title" : "Un seul mécanisme de navigation est présent",
			"detail" : "Au moins 2 mécanismes de navigation doivent être présent sur l'interface.",
			"solution" : "Compléter le mécanisme existant avec une solution listée ci-dessous : \n -  un menu de navigation principal \n - une table des matières \n - un sitemap \n - un mécanisme de recherche \n - une liste de liens permettant de naviguer à travers tout le site (pied de page).",
			"technicalSolution" : ""
		}
	],
	"testWebID-35": [
		{
			"title" : "Absence d'information visuelle sur la position courante de l'utilisateur au sein de la hiérarchisation",
			"detail" : "La position courante au sein de la hiérarchisation d'un site ne peut être déterminée visuellement.",
			"solution" : "- ajouter un fil d'ariane \n - navigation principale : ajouter une indication visuelle, ne dépendant pas uniquement de la couleur (ex : souligner l'item actif)",
			"technicalSolution" : ""
		}, {
			"title" : "La position courante au sein de la hiérarchisation ne peut être déterminée de manière programmatique",
			"detail" : "La position courante au sein de la hiérarchisation ne peut être déterminée de manière programmatique (depuis une aide technique telle qu'un lecteur d'écran par exemple).",
			"solution" : "- fil d'ariane : appliquer un attribut aria-current=\"location\" sur l'élément actif \n - navigation principale : ajouter un attribut aria-current=\"page\" sur l'item actif.",
			"technicalSolution" : "- fil d'ariane : <li aria-current=\"location\"> [...] </li> \n- navigation principale : <a [...] aria-current=\"page\"> [...] </a> \n- procédure, étapes multiples : <a [...] aria-current=\"step\"> [...] </a>."
		}
	],
	"testWebID-36": [
		{
			"title" : "Absence de roles ARIA (status, alert, alertdialog...) ou de régions dynamiques aria-live",
			"detail" : "Les messages d'alertes ne sont pas perçus depuis un lecteur d'écran.",
			"solution" : "Appliquer un role ARIA (\"status\", \"alert\", \"alertdialog\", etc...) ou un attribut \"aria-live\" au message d'alerte afni qu'il soit vocalisé automatiquement dés apparition.",
			"technicalSolution" : "exemples :\n - <div role=\"status\"> [...] </div> \n - <div aria-live=\"assertive\">[...]</div>"
		}
	],
	"testWebID-37": [
		{
			"title" : "Absence de mécanisme permettant de stopper un contenu en mouvement",
			"detail" : "L'utilisateur doit avoir le contrôle des contenus en mouvement.",
			"solution" : "Proposer un mécanisme accessible permettant de stopper ou mettre en pause un contenu en mouvement.",
			"technicalSolution" : ""
		}
	],
	"testWebID-38": [
		{
			"title" : "Élément non utilisable au clavier",
			"detail" : "Un élément n'est pas utilisable depuis une navigation clavier.",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testWebID-39": [
		{
			"title" : "Déplacement du focus non-logique",
			"detail" : "Le déplacement du focus ne suit pas un ordre logique (sens de lecture).",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testWebID-40": [
		{
			"title" : "La visualisation du focus (outline) est désactivée",
			"detail" : "Le outline ne doit pas être désactivé.",
			"solution" : "Vérifier que le outline n'est pas supprimé depuis une propriété css (ex : \"outline:none;\").",
			"technicalSolution" : ""
		}
	],
	"testWebID-41": [
		{
			"title" : "La visualisation du focus (outline) ne possède pas un contraste suffisant",
			"detail" : "Le outline doit avoir un contraste suffisant avec la couleur de fond quelques soit le contexte.",
			"solution" : "- préserver le outline par défaut \n- si la couleur du outline est personnalisée, veiller à ce que la couleur respecte un ratio de 3:1 avec la couleur de fond quelque soit le contexte.",
			"technicalSolution" : ""
		}
	],
	"testWebID-42": [
		{
			"title" : "Présence de textes tronqués ou de chevauchement",
			"detail" : "Des contenus sont tronqués ou se chevauchent après un zoom à 200% du texte.",
			"solution" : "- appliquer des unités relatives (em, rem, %) aux conteneurs de textes \n- ou utiliser des propriétés \"min-width\" et \"min-height\" à la place des propriétés \"width\" et \"height\".",
			"technicalSolution" : ""
		}
	],
	"testWebID-43": [
		{
			"title" : "Présence d'une barre de défilement horizontale",
			"detail" : "Une barre de défilement horizontale apparaît après un redissionnement de l'interface à 320 px css de large.",
			"solution" : "- appliquer des unités relatives (em, rem, %) aux conteneurs de textes \n- ou utiliser des propriétés \"min-width\" et \"min-height\" à la place des propriétés \"width\" et \"height\".",
			"technicalSolution" : ""
		}
	],
	"testWebID-44": [
		{
			"title" : "Présence de textes tronqués ou de chevauchement",
			"detail" : "Des contenus sont tronqués ou se chevauchent après application de propriétés d'aération du texte.",
			"solution" : "Ne pas imposer ou hériter une taille absolue (px, ...) aux propriétés d'espacement.",
			"technicalSolution" : "- appliquer des unités relatives (em, rem, %) aux propriétés d'espacement de textes \n- appliquer des unités relatives (em, rem, %) aux conteneurs de textes \n- ou utiliser des propriétés \"min-width\" et \"min-height\" à la place des propriétés \"width\" et \"height\"."
		}
	],
	"testWebID-45": [
		{
			"title" : "Composants répétés sur plusieurs pages, dans des ordres différents",
			"detail" : "Des composants répétés sur plusieurs pages, n'apparaissent pas dans le même ordre sur certaines pages.",
			"solution" : "La mise en page des composants doit être homogène entre toutes les pages d'un site. Les composants doivent apparaitre de manière constante, dans le même ordre relatif.",
			"technicalSolution" : ""
		}
	],
	"testWebID-46": [
		{
			"title" : "La surface cliquable de certains éléments interactifs n'est pas suffisante.",
			"detail" : "La surface cliquable des éléments interactifs doit dépasser 44 par 44 CSS pixels.",
			"solution" : "- agrandir la surface cliquable pour atteindre au moins 44 par 44 CSS pixels\n- proposer un mécanisme dans la page permettant d'agrandir la taille sans avoir recours au zoom",
			"technicalSolution" : ""
		}
	],
	"testWebID-47": [
		{
			"title" : "Présence de champs non-labellisés",
			"detail" : "Tous les éléments de formulaire doivent posséder un label.",
			"solution" : "Appliquer une des solutions ci-dessous :\n- ajout d'un élément \"label\", en masquage accessible si nécessaire, lié de manière programmatique au champ\n- utilisation d'un aria-labelledby pointant vers une information pertinente pour comprendre la nature du champ \n- ajout d'un attribut aria-label\n- ajout d'un attribut title",
			"technicalSolution" : "Exemples :\n- <label for=\"idInput\">[...]</label> <input id=\"idInput\" type=\"[...]\">\n- <h2 id=\"idHeading\">[...]</h2> <input aria-labelledby=\"idHeading\" type=\"[...]\">\n-  <input aria-label=\"[...]\" type=\"[...]\">\n- <input title=\"[...]\" type=\"[...]\">"
		}
	],
	"testWebID-48": [
		{
			"title" : "Présence de champs non-pertinents",
			"detail" : "Tous les éléments de formulaire doivent posséder un label pertinent, permettant de comprendre la nature du champ.",
			"solution" : "Compléter le libellé texte du label.",
			"technicalSolution" : ""
		}
	],
	"testWebID-49": [
		{
			"title" : "Absence de format de données",
			"detail" : "Un format de données est nécessaire pour permettre à tous les utilisateurs de renseigner correctement une information.",
			"solution" : "Ajouter un format de données. Ce format est lié de manière programmatique au champ.",
			"technicalSolution" : "Appliquer une des solutions ci-dessous :\n- intégrer le format de donnée dans l'élément label\nexemple : <label for=\"idInput\">Date JJ/MM/AAAA</label>\n- lier le format au champ via un attribut aria-describedby\nexemple : <input aria-describedby=\"idDesc\" [...]><p id=\"idDesc\">Format de saisie : JJ/MM/AAAA</p>"
		},{
			"title" : "Le format de données n'est pas lié de manière programmatique au champ",
			"detail" : "Dans le cas le format de données ne sera pas perçu depuis une aide technique (exemple : lecteur d'écran).",
			"solution" : "Ajouter un format de données. Ce format est lié de manière programmatique au champ.",
			"technicalSolution" : "Appliquer une des solutions ci-dessous :\n- intégrer le format de donnée dans l'élément label\nexemple : <label for=\"idInput\">Date JJ/MM/AAAA</label>\n- lier le format au champ via un attribut aria-describedby\nexemple : <input aria-describedby=\"idDesc\" [...]><p id=\"idDesc\">Format de saisie : JJ/MM/AAAA</p>"
		}
	],
	"testWebID-50": [
		{
			"title" : "Champ obligatoire non identifiable visuellement",
			"detail" : "L'identification visuelle du champ obligatoire ne repose pas uniquement sur la couleur.",
			"solution" : "Ajouter une information visuelle ne reposant pas uniquement sur la couleur, exemple : astérisque, icône, etc...",
			"technicalSolution" : ""
		},
		{
			"title" : "Champ obligatoire non identifiable ne manière programmatique",
			"detail" : "L'identification d'un champ obligatoire n'est pas possible depuis une aide technique (ex: lecteur d'écran), si elle n'est pas donner de manière programmatique.",
			"solution" : "Utiliser une des techniques ci-dessous :\n- information visuelle intégrée dans le label\n- ajout d'un attribut \"required\" sur l'input \n- ajout d'un attribut \"aria-required\" sur l'input",
			"technicalSolution" : ""
		}
	],
	"testWebID-51": [
		{
			"title" : "Présence de champs non-groupés",
			"detail" : "Lorque nécessaire les champs ne même natures doivent être groupés",
			"solution" : "- appliquer un \"fieldset\" complété par un élément \"legend\"\n- appliquer un role \"group\" sur l'élément parent encapsulant les champs, et compléter par une légende basée sur un aria-labelledby",
			"technicalSolution" : ""
		}
	],
	"testWebID-52": [
		{
			"title" : "Présence de messages d'erreurs non-pertinents",
			"detail" : "Des messages d'erreurs sont absents ou non pertinents.",
			"solution" : "Les messages d'erreurs doivent permettre aux utilisateurs de corriger facilement leurs erreurs de saisie.",
			"technicalSolution" : ""
		}
	],
	"testWebID-53": [
		{
			"title" : "Des messages d'erreurs ne sont pas perçus par les utilisateurs",
			"detail" : "Les messages d'erreurs doivent être perçus par tous les utilisateurs, quelques-soit leur équipement.",
			"solution" : "Appliquer une des techniques ci-dessous :\n- Le message d'erreur est présent avant le formulaire.\nLe message liste les champs en erreur.\nLe focus est positionné sur le message d'erreur.\nDes ancres permettent à l'utilisateur de se positionner sur les champs en erreurs.\n-Les messages d'erreurs sont ajoutés dans les labels des champs.\n- Les messages d'erreurs ne sont pas intégrés dans les labels, mais un mécanisme est présent afin de lier les champs et les erreurs de manière programmatique : voir aria-describedby ",
			"technicalSolution" : ""
		}
	],
	"testWebID-54": [
		{
			"title" : "Des données importantes sont soumises sans possibilité d'être annuler ou vérifier",
			"detail" : "Les utilisateurs doivent avoir le contrôle lors de la soumission de données importantes (engagement juridique, transaction financière, modification ou effacement de données importantes, réponse à un test ou examen...).",
			"solution" : "Appliquer une des solutions ci-dessous :\n- L'action peut être annulée\n- une étape de confirmation permettant la vérification ou la modification est présente avant validation ",
			"technicalSolution" : "Exemple :\nAprès soumission du formulaire, un message de confirmation apparaît dans une popin.\nLe message reprend les données saisies par l'utilisateur, et donne la possibilité de valider ou annuler.\nSi l'utilisateur annule, il est redirigé vers le formulaire, ses saisies sont toujours présentes dans les champs, avec la possibilité de les modifier."
		}
	],
	"testWebID-55": [
		{
			"title" : "Absence d'attribut autocomplete pour des champs présentant des données personnelles",
			"detail" : "Tout champ permettant de collecter des données spécifiques sur l'utilisateur, doit posséder un attribut \"autocomplete\".",
			"solution" : "Ajouter un attribut \"autocomplete\" sur l'input. La valeur de l'autocomplete dépend de la nature de l'information collectée dans le champ.",
			"technicalSolution" : "exemples : autocomplete=\"username\", autocomplete=\"new-password\", autocomplete=\"postal-code\", etc... "
		}
	],
	"testWebID-56": [
		{
			"title" : "Le zoom n'est pas autorisé",
			"detail" : "L'agrandissement du texte à 200% doit être possible.",
			"solution" : "Si une balise \"<meta name= 'viewport'>\" est présente :\n- le paramètre user-scalable='no' n’est pas présent\n- et le paramètre maximum-scale n’est pas inférieur à 2 ",
			"technicalSolution" : ""
		}
	],
	"testWebID-57": [
		{
			"title" : "Une action ne peut être annulée",
			"detail" : "L'action ne peut être annulée car déclenchée sur l'évènement DOWN.",
			"solution" : "- déclencher l'action sur l'évènement UP\n- pour des composants complexes (ex : drag n'drop), l'action sur le UP est complétée par une boîte de dialogue donnant la possibilité aux utilisateurs d'annuler leur action.",
			"technicalSolution" : ""
		}
	],
	"testWebID-58": [
		{
			"title" : "Une action basée sur une gestuelle complexe ne possède pas d'alternative",
			"detail" : "Toute action basée sur une gestuelle complexe doit posséder une alternative basée sur un seul pointeur.",
			"solution" : "Exemple : pour une action de zoom sur une carte au pincement de doigt, une alternative sous forme de <button> [+] et [-] est proposée.",
			"technicalSolution" : ""
		}
	],
	"testWebID-59": [
		{
			"title" : "Perte d'information lors d'une consultation en mode portrait ou paysage",
			"detail" : "Le contenu et les fonctionnalités doivent être disponibles dans les 2 orientations sans pertes d'informations.",
			"solution" : "",
			"technicalSolution" : ""
		}
	],
	"testWebID-60": [
		{
			"title" : "L'état d'un composant n'est pas perçue depuis un lecteur d'écran",
			"detail" : "Les états coché/décochés, plié/déplié, etc... ne sont pas percue depuis un lecteur d'écran",
			"solution" : "- utiliser en priorité des composants natifs (exemple : utiliser des input checkbox pour des cases à cocher, l'état sera géré nativement\n- sinon veiller à appliquer les patterns ARIA, pour assurer une sémantique correcte et une gestion des états des composants (cf. attributs aria-expanded, aria-selected, etc...)",
			"technicalSolution" : ""
		}, {
			"title" : "Un composant interactifs n'est pas utilisable depuis un lecteur d'écran",
			"detail" : "Les fonctionnalités d'un composant ne pas utilisables depuis un lecteur d'écran",
			"solution" : "- utiliser en priorité des composants natifs (exemple : utiliser des input checkbox pour des cases à cocher, l'état sera géré nativement\n- sinon veiller à appliquer les patterns ARIA, pour assurer une sémantique correcte",
			"technicalSolution" : ""
		}
	]
}
