{
	"name": "Audit conformité WCAG / ANDROID",
	"items":[{
		"themes": "Écran de saisie",
		"title": "Chaque champ de saisie possède-t-il une étiquette ?",
		"ID": "testID-001",
		"IDorigin": "testID-001",
		"wcag": [
			"1.3.1 A",
			"2.4.6 AA",
			"3.3.2 A"
		],
		"verifier": "<p>Vérifier que chaque champ a une étiquette (<code>TextView</code> associé) et que celle-ci est pertinente.</p>",
		"group": "Écran de saisie",		
		"resultatTest": "nt"
	},{
		"themes": "Écran de saisie",
		"title": "Les champs sont-ils regroupés lorsque nécessaire&nbsp;?",
		"ID": "testID-002",
		"IDorigin": "testID-002",
		"wcag": [
			"1.3.1 A",	
			"3.3.2 A"
		],
		"verifier": "<p>Vérifier que les champs sont regroupés lorsque nécessaire, par exemple :</p><ul><li>pour une adresse (champs rue, code postal, ville, etc...)</li><li>pour une liste de <code>RadioButton</code>, l'utilisation de la propriété <code>RadioGroup</code> étant nécessaire</li><li>pour une liste de <code>Checkbox</code></li></ul>",
		"group": "Écran de saisie",		
		"resultatTest": "nt"
	},{
		"themes": "Écran de saisie",
		"title": "Les champs obligatoires sont-ils identifiables&nbsp;?",
		"ID": "testID-003",
		"IDorigin": "testID-003",
		"wcag": [
			"1.3.1 A",
			"3.3.2 A"
		],
		"verifier": "<ul><li>Vérifier la présence d'une identification visuelle du champ obligatoire ne reposant pas uniquement sur la couleur (ex&nbsp;: astérisque).</li><li>Vérifier que l'obligation du champ est bien vocalisée avec la navigation vocale.</li><li>Vérifier que le formulaire ne peut pas être validé si le champ obligatoire n'est pas renseigné.</li></ul>",
		"group": "Écran de saisie",		
		"resultatTest": "nt"
	},{
		"themes": "Écran de saisie",
		"title": "Pour les champs nécessitant un type ou un format de données précis, ce format de données est-il indiqué clairement à l'utilisateur&nbsp;?",
		"ID": "testID-004",
		"IDorigin": "testID-004",
		"wcag": [
			"3.3.2 A"

		],
		"verifier": "<ul><li>Vérifier que le format de saisie est présent visuellement, et que son positionnement permet de l'associer au champ concerné.</li><li>Vérifier que le format de saisie est présent dans la vocalisation du champ.</li></ul>",
		"group": "Écran de saisie",		
		"resultatTest": "nt"
	},{
		"themes": "Écran de saisie",
		"title": "Un remplissage automatique est-il présent pour les champs de saisie destinés à contenir des informations sur l'utilisateur&nbsp;?",
		"ID": "testID-005",
		"IDorigin": "testID-005",
		"wcag": [
			"1.3.5 AA"
		],
		"verifier": "<ul><li>Pour les champs de saisie destinés à contenir une information sur l'utilisateur (nom, adresse…), vérifier la présence de la propriété <code>autofill</code>.</li><li>La valeur indiquée pour la propriété <code>autofill</code> est pertinente au regard du type d'information attendue.</li></ul>",
		"group": "Écran de saisie",		
		"resultatTest": "nt"
	},{
		"themes": "Écran de saisie",
		"title": "Les champs en erreur sont-ils identifiables&nbsp;?",
		"ID": "testID-006",
		"IDorigin": "testID-006",
		"wcag": [
			"3.3.1 A"
		],
		"verifier": "<p>Vérifier que le champ en erreur est modifié (ex&nbsp;: ajout de la mention «&nbsp;erreur&nbsp;», ajout d'une icône, passage du champ en couleur rouge).</p>",
		"group": "Écran de saisie",		
		"resultatTest": "nt"
	},{
		"themes": "Écran de saisie",
		"title": "Les messages d'erreur sont-ils explicites&nbsp;?",
		"ID": "testID-007",
		"IDorigin": "testID-007",
		"wcag": [
			"3.3.1 A"
		],
		"verifier": "<p>Vérifier qu'un message d'erreur est présent visuellement, qu'il permet d'identifier explicitement le champ en erreur et de comprendre la nature de l'erreur.</p>",
		"group": "Écran de saisie",		
		"resultatTest": "nt"
	},{
		"themes": "Écran de saisie",
		"title": "En cas d'erreur, est-ce qu'une suggestion de correction est proposée à l'utilisateur&nbsp;?",
		"ID": "testID-008",
		"IDorigin": "testID-008",
		"wcag": [
			"3.3.3 AA"
		],
		"verifier": "<p>Vérifier que les messages d'erreurs donnent les informations nécessaires à la correction des saisies.</p>",
		"group": "Écran de saisie",		
		"resultatTest": "nt"
	},{
		"themes": "Écran de saisie",
		"title": "Si l'écran de saisie est sensible, l'utilisateur a-t-il le contrôle de ses données&nbsp;?",
		"ID": "testID-009",
		"IDorigin": "testID-009",
		"wcag": [
			"3.3.4 AA"
		],
		"verifier": "<p>Pour les champs de saisie avec&nbsp;:</p><ul><li>modification ou suppression de données,</li><li>transmission de réponse à un test ou un examen,</li><li>conséquences financières (achat en ligne) ou juridiques (validation de conditions générales d'utilisation),</li></ul><p>l'utilisateur peut modifier ou annuler avant et après validation sauf si la validation est explicite (avec une case à cocher par exemple).</p>",
		"group": "Écran de saisie",		
		"resultatTest": "nt"
	},{
		"themes": "Entêtes",
		"title": "L'écran a-t-il un titre visible ?",
		"ID": "testID-010",
		"IDorigin": "testID-010",
		"wcag": [
			"2.4.2 A"
		],
		"verifier": "<p>Vérifier que le titre de l'<code>Activity</code> est renseigné.</p>",
		"resultatTest": "nt"
	},{
	"themes": "Entêtes",
		"title": "L'écran a-t-il un titre qui lui est unique ?",
		"ID": "testID-011",
		"IDorigin": "testID-011",
		"wcag": [
			"2.4.2 A"
		],
		"verifier": "<p>Vérifier que le titre de l'<code>Activity</code> est unique. Une erreur courante est d'utiliser un même titre pour l'ensemble de l'application.</p>",
		"resultatTest": "nt"
	},{
	"themes": "Entêtes",
		"title": "L'écran a-t-il un titre pertinent ?",
		"ID": "testID-012",
		"IDorigin": "testID-012",
		"wcag": [
			"2.4.2 A"
		],
		"verifier": "<p>Vérifier que le titre de l'<code>Activity</code> permet à l'utilisateur de comprendre le contexte de la page.</p>",
		"resultatTest": "nt"
	},{
	"themes": "Couleurs et contrastes",
		"title": "Le contraste entre la couleur du texte et la couleur de son arrière-plan est-il suffisamment élevé (hors cas particuliers)&nbsp;?",
		"ID": "testID-013",
		"IDorigin": "testID-013",
		"wcag": [
			"1.4.3 AA"
		],
		"verifier": "<p>Vérifier que le contraste est suffisant pour comprendre l'information portée par tous les textes.</p><ul><li><strong>Pour texte standard</strong> <ul><li>Taille inférieure à <code>18sp</code>&nbsp;: contraste de 4,5:1</li><li>Taille supérieure ou égale à <code>18sp</code>&nbsp;: contraste de 3:1</li></ul></li><li><strong>Pour les textes gras</strong> <ul><li>Taille inférieure à <code>14sp</code>&nbsp;: contraste de 4,5:1</li><li>Taille supérieure ou égale à <code>14sp</code>&nbsp;: contraste de 3:1</li></ul></li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Couleurs et contrastes",
		"title": "Les couleurs utilisées dans les composants d'interface ou dans les éléments graphiques porteurs d'informations sont-elles suffisamment contrastées&nbsp;?",
		"ID": "testID-014",
		"IDorigin": "testID-014",
		"wcag": [
			"1.4.11 AA"
		],
		"verifier": "<p>Vérifier que les textes sous forme d'images, les graphiques, les icônes et les composants interactifs ont un contraste minimum de 3:1 pour transmettre l'information.</p>",
		"exception": "<ul><li>les logos</li><li>si un texte apporte la même information que l'icône ou le graphique</li><li>si le manque de contraste de l'image n'empêche pas la compréhension du contenu ou de sa fonction</li><li>les composants inactifs</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Couleurs et contrastes",
		"title": "L'information est-elle également transmise à l'utilisateur par un autre moyen que par la couleur&nbsp;?",
		"ID": "testID-015",
		"IDorigin": "testID-015",
		"wcag": [
			"1.4.1 A"
		],
		"verifier": "<p>Vérifier que la couleur n'est pas le seul moyen de véhiculer d'information&nbsp;:</p><ul><li>l'information peut également être obtenue par un texte</li><li>au moins un autre moyen visuel est disponible pour obtenir la même information (exemple&nbsp;: des icônes utilisent des couleurs, mais également des formes différentes).</li></ul>\n<p>Non applicable, si aucune information n'est portée par de la couleur.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Couleurs et contrastes",
		"title": "L'information est-elle également transmise à l'utilisateur par un autre moyen qu'une caractéristique sensorielle&nbsp;?",
		"ID": "testID-016",
		"IDorigin": "testID-016",
		"wcag": [
			"1.3.3 A"
		],
		"verifier": "<p>Vérifier que l'information transmise par une information sensorielle (forme, taille, position, orientation, son) peut également être obtenue par un texte ou un message explicite.</p>\n<p>Non applicable, si aucune information n'est portée par le son, l'orientation, la taille, la forme ou la position.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Agrandissement des éléments",
		"title": "Le texte peut-il être agrandi sans perte de contenu ou de fonctionnalité ? ",
		"ID": "testID-017",
		"IDorigin": "testID-017",
		"wcag": [
			"1.4.4 AA",
			"1.4.10 AA"
		],
		"verifier": "<p>Vérifier l'absence de perte d'information (pas de contenu ou de fonctionnalité inutilisable, tronqué ou masqué) suite à l'agrandissement de la taille du texte à 200%.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation vocale",
		"title": "Les éléments signifiants sont-ils tous vocalisés ? ",
		"ID": "testID-018",
		"IDorigin": "testID-018",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<p>Vérifier que tous les éléments signifiants sont vocalisés et accessibles en utilisant la navigation vocale.</p><ul><li>Chaque élément est vocalisé de façon pertinente (point d'attention notamment sur les images porteuses d'informations et les <code>ImageButton</code> qui n'ont pas de texte initialement).</li><li>Chaque élément interactif est vocalisé avec l'action associée.</li><li>Le titre de l'activité est vocalisé.</li><li>Chaque élément d'une liste a-t-il une description pertinente et unique ?</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation vocale",
		"title": "L'ordre de vocalisation des éléments est-il logique et compréhensible ? ",
		"ID": "testID-019",
		"IDorigin": "testID-019",
		"wcag": [
			"1.3.2 A",
			"2.4.3 A"
		],
		"verifier": "<p>Vérifier que les éléments suivent un ordre logique et compréhensible en utilisant la navigation vocale.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation vocale",
		"title": "Les éléments reliés sont-ils groupés au sein d'un même bloc d'annonce pour la vocalisation ?",
		"ID": "testID-020",
		"IDorigin": "testID-020",
		"wcag": [
			"1.3.1 A"
		],
		"verifier": "<p>Vérifier que les éléments liés sont vocalisés en un seul bloc :</p><ul><li>les éléments reliés sont-ils groupés au sein d'un même bloc d'annonce pour la vocalisation</li><li>les informations multidimensionnelles respectent-ils une bonne balance entre nombre de blocs et contenu dans chaque bloc ?</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation vocale",
		"title": "Les entêtes de section sont-ils exploités lors de la navigation vocale par entête ? ",
		"ID": "testID-022",
		"IDorigin": "testID-022",
		"wcag": [
			"2.4.6 AA"
		],
		"verifier": "<p>Vérifier qu'avec la navigation vocale Talkback et le paramètre de navigation par entête défini :</p><ul><li>tous les entêtes de section sont navigables et vocalisés</li><li>seuls les entêtes sont navigables et vocalisés</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation vocale",
		"title": "Les changements de contenu sont-ils vocalisés ? ",
		"ID": "testID-023",
		"IDorigin": "testID-023",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<p>Vérifier qu'avec la navigation vocale, les changements de contenu sont restitués vocalement à l'utilisateur :</p><ul><li>l'ouverture des fenêtres surgissantes (<code>dialogs</code>) est vocalisée</li><li>l'ouverture d'un nouvel écran (activité) est vocalisée par son titre</li><li>l'information du changement d'une partie de l'écran (comme un fragment qui change) est vocalisée</li><li>les défilements horizontaux sont vocalisés</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation vocale",
		"title": "Les messages de statuts ou contextuels sont-ils correctement restitués ?",
		"ID": "testID-049",
		"IDorigin": "testID-049",
		"wcag": [
			"4.1.3 AA"
		],
		"verifier": "<p>Vérifier qu'un mécanisme reposant sur les régions live est implémenté :</p><ul><li>les messages temporaires sont vocalisés</li><li>les messages d'erreurs sont vocalisés</li><li>le changement d'un élément est vocalisé s'il est utile pour l'utilisateur d'en être informé</li><li>la progression d'une mise à jour du contenu est vocalisée</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation vocale",
		"title": "Les états des éléments sont-ils vocalisés ? ",
		"ID": "testID-024",
		"IDorigin": "testID-024",
		"wcag": [
			"4.1.2 A"
		],
		"verifier": "<p>Vérifier que les états des éléments sont vocalisés (onglets, case à cocher, bouton radio, etc).</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation vocale",
		"title": "Les éléments visibles sont-ils les seuls à être vocalisés ? ",
		"ID": "testID-025",
		"IDorigin": "testID-025",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<p>Vérifier qu'il n'y a aucun élément fantôme avec la navigation vocale.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation vocale",
		"title": "Les éléments décoratifs sont-ils ignorés par la navigation vocale ? ",
		"ID": "testID-026",
		"IDorigin": "testID-026",
		"wcag": [
			"1.1.1 A"
		],
		"verifier": "<p>Vérifier que les éléments décoratifs (comme certaines images) ne sont pas vocalisés.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation vocale",
		"title": "La vocalisation d'un élément textuel contient-il au minimum le libellé visible à l'écran pour ce même élément ? ",
		"ID": "testID-051",
		"IDorigin": "testID-051",
		"wcag": [
			"2.5.3 A"
		],
		"verifier": "<p>Vérifier que le libellé de l'élément est présent (en premier si possible) dans la vocalisation de ce composant. Non applicable si l'élément n'a pas de libellé visible (icône sans texte par exemple).</p>",
		"resultatTest": "nt"
	},{

		"themes": "Navigation au clavier (Switch Access)",
		"title": "Les fonctionnalités de la page sont-elles utilisables avec Switch Access ?",
		"ID": "testID-027",
		"IDorigin": "testID-027",
		"wcag": [
			"2.1.1 A"
		],
		"verifier": "<p>Vérifier que :</p><ul><li>toutes les fonctionnalités sont disponibles avec Switch Access</li><li>seuls les éléments interactifs sont accessibles avec Switch Access</li><li>les éléments sont regroupés lorsqu'ils sont liés (Ex : contenu au sein d'une ligne cliquable d'une liste)</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation au clavier (Switch Access)",
		"title": "L'écran ne contient pas de piège clavier&nbsp;?",
		"ID": "testID-028",
		"IDorigin": "testID-028",
		"wcag": [
			"2.1.2 A"
		],
		"verifier": "<p>Vérifier que l'écran ne contient aucun piège clavier avec Switch Access.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation au clavier (Switch Access)",
		"title": "L'ordre de prise de focus des éléments est-il logique et cohérent&nbsp;?",
		"ID": "testID-029",
		"IDorigin": "testID-029",
		"wcag": [
			"2.4.3 A"
		],
		"verifier": "Vérifier que l'ordre de prise de focus des éléments (boutons, liens, champs de formulaires) est cohérent et logique (souvent équivalent à l'ordre visuel) avec Switch Access.",
		"resultatTest": "nt"
	},{
		"themes": "Navigation au clavier (Switch Access)",
		"title": "La prise de focus est-elle visible&nbsp;?",
		"ID": "testID-030",
		"IDorigin": "testID-030",
		"wcag": [
			"2.4.7 AA"
		],
		"verifier": "<p>Vérifier que le focus est visible d'un coup d'oeil et qu'il se distingue bien du reste de l'écran.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Les actions déclenchées par un mouvement de l'appareil ou un geste de l'utilisateur disposent-elles d'une alternative ?",
		"ID": "testID-031",
		"IDorigin": "testID-031",
		"wcag": [
			"2.5.4 A"
		],
		"verifier": "<ul><li>Vérifier que ces actions ont des alternatives disponibles depuis un composant d'interfaces (ex.&nbsp;: bouton).</li><li>Vérifier qu'il est possible de désactiver la détection de mouvement.</li></ul>",
		"exception": "<p>Le mouvement est essentiel à l'accomplissement de la fonctionnalité (ex.&nbsp;: podomètre)</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Les gestes multipoints ou basés sur une trajectoire disposent-ils d'une alternative nécessitant un seul pointeur sans trajectoire&nbsp;?",
		"ID": "testID-032",
		"IDorigin": "testID-032",
		"wcag": [
			"2.5.1 A"
		],
		"verifier": "<p>Vérifier que pour tout geste multipoints (nécessitant plusieurs doigts) et/ou nécessitant des trajectoires gestuelles, une alternative nécessitant un seul pointeur (un seul doigt) et sans trajectoire gestuelle est disponible.</p>",
		"complement": "<h4>Exemple</h4><p><stong>Zoom sur une carte&nbsp;: </strong>des boutons (+ / -) sont disponibles, en alternative au pincé.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Les erreurs de clic (ou de toucher) peuvent-elles être annulées&nbsp;?",
		"ID": "testID-033",
		"IDorigin": "testID-033",
		"wcag": [
			"2.5.2 A"
		],
		"verifier": "<p>Les actions déclenchées au moyen d'un dispositif de pointage sur un point unique de l'écran doivent pouvoir être annulées&nbsp;:</p><ul><li>vérifier qu'aucune action n'est déclenchée sur le <span lang=\"en\">'down event'</span> (dès qu'on touche ou qu'on presse un élément) et qu'il est possible d'annuler en relâchant le pointeur en dehors de l'élément déclencheur</li><li>si une action est déclenchée lors de l'appui, vérifier que celle-ci est annulée dès le relâchement du pointeur</li><li>pour des actions complexes (ex&nbsp;: <span lang=\"en\">drag n'drop</span>), vérifier que l'utilisateur peut annuler l'action avant la fin de son exécution à travers une modale de confirmation par exemple.</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "L'écran est-il consultable quelle que soit l'orientation (portrait ou paysage)&nbsp;?",
		"ID": "testID-034",
		"IDorigin": "testID-034",
		"wcag": [
			"1.3.4 AA"
		],
		"verifier": "<p>Vérifier que le contenu et les fonctionnalités sont disponibles dans les deux orientations (pas de perte d'information, pas d'élément tronqué).</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Les éléments cliquables ont-ils une zone de clic suffisamment grande ?",
		"ID": "testID-050",
		"IDorigin": "testID-050",
		"wcag": [
			"2.5.5 AAA"
		],
		"verifier": "<p>Vérifier que :</p><ul><li>les éléments interactifs ont une zone de clic supérieur ou égal à 48dp</li><li>Les éléments interactifs ont une marge qui les sépare des autres éléments ou des bords de l'écran</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Tous les éléments qui ont la même fonction sont-ils nommés de manière identique ?",
		"ID": "testID-035",
		"IDorigin": "testID-035",
		"wcag": [
			"3.2.4 AA"
		],
		"verifier": "<p>Vérifier que les composants qui ont la même fonction sont nommés de manière identique d'un écran à l'autre, et au sein d'un même écran si un composant est répété.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Une UI avec limite de temps a-t-elle son délai adaptable ?",
		"ID": "testID-036",
		"IDorigin": "testID-036",
		"wcag": [
			"2.2.1 A"
		],
		"verifier": "<p>Vérifier que le délai provoquant un changement de contexte automatique (par exemple, l'overflow de contrôle d'une vidéo qui disparaît après quelques secondes) est adaptable : soit depuis le paramètre d'accessibilité 'Time to take action', soit directement depuis l'application.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Les textes sont-ils lisibles sans difficulté ?",
		"ID": "testID-037",
		"IDorigin": "testID-037",
		"wcag": [
			"1.4.12 AA"
		],
		"verifier": "<p>Vérifier que :</p><ul><li>les textes ont une taille suffisante pour être lus facilement</li><li>la police d'écriture utilisée est sans empattement</li><li>le texte n'est pas en italique</li></ul>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "L'utilisateur a-t-il le contrôle des changements de contexte&nbsp;?",
		"ID": "testID-038",
		"IDorigin": "testID-038",
		"wcag": [
			"3.2.1 A",
			"3.2.2 A"
		],
		"verifier": "<p>Lors de l'utilisation de formulaire ou de tout composant interactif, vérifier l'absence de changement de contexte&nbsp;:</p><ul><li>lors de la prise de focus d'un élément</li><li>lors de la saisie de données</li><li>lors de l'activation d'un élément de formulaire autre qu'un bouton</li></ul>",
		"complement": "<h4>Changement de contexte</h4><p>Changement majeur dans le contenu de l'écran qui, lorsqu'il est effectué à l'insu de l'utilisateur, peut désorienter les utilisateurs incapables d'afficher la page dans sa totalité.</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Si un contenu de l'écran est en mouvement ou clignote plus de 5 secondes, l'utilisateur a-t-il la possibilité de stopper, mettre en pause ou masquer ce contenu&nbsp;?",
		"ID": "testID-039",
		"IDorigin": "testID-039",
		"wcag": [
			"2.2.2 A"
		],
		"verifier": "<p>Non applicable, si aucun mouvement ou clignotement ne dure plus de 5 secondes</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Il n'y a aucun clignotement de plus de 3 flashs par seconde sur une zone égale ou supérieure à <code>21 824 px²</code>",
		"ID": "testID-040",
		"IDorigin": "testID-040",
		"wcag": [
			"2.3.1 A"
		],
		"verifier": "<p>Non applicable, si les clignotements flashent moins de 3 fois par seconde ou sur une zone de moins de <code>21 824 px²</code></p>",
		"resultatTest": "nt"
	},{	
		"themes": "Navigation générale",
		"title": "Le mécanisme de navigation est cohérent avec les autres écrans de l'application",
		"ID": "testID-056",
		"IDorigin": "testID-056",
		"wcag": [
			"3.2.3 AA"
		],
		"verifier": "<p>Vérifier que les mécanismes de navigation sont toujours situés au même endroit dans un ensemble d'écrans (entre les différentes activités de l'application).</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Aucune image n'est utilisée pour présenter du texte ?",
		"ID": "testID-052",
		"IDorigin": "testID-052",
		"wcag": [
			"1.4.5 AA"
		],
		"verifier": "<p>Vérifier que les images ne sont pas utilisées pour présenter du texte (hors cas particulier : logo, captcha, dénomination commerciale).</p>",
		"resultatTest": "nt"
	},{
		"themes": "Navigation générale",
		"title": "Les textes sont-ils internationalisés ?",
		"ID": "testID-053",
		"IDorigin": "testID-053",
		"wcag": [
			"3.1.1 A"
		],
		"verifier": "<p>Vérifier que les textes présents dans l'application s'adaptent à la langue choisie dans les paramètres du téléphone.</p>",
		"resultatTest": "nt"
	},{

		"themes": "Navigation générale",
		"title": "Chaque libellé de lien est-il explicite, au minimum dans son contexte ?",
		"ID": "testID-054",
		"IDorigin": "testID-054",
		"wcag": [
			"2.4.4 A"
		],
		"verifier": "<p>L'utilisateur doit être capable de savoir s'il souhaite suivre un lien sans avoir à se déplacer dans l'écran pour comprendre de quoi il s'agit.</p><ul><li>vérifier qu'il n'y a pas de libellés identiques pointant vers des destinations différentes</li><li>vérifier qu'il est possible de déterminer l'action ou la destination d'un lien ou d'un bouton uniquement à partir de son nom accessible</li><li>si ce n'est pas le cas, vérifier que la cible d'un lien ou l'action portée par un bouton est au moins compréhensible grâce à son contexte direct.</li></ul>",
		"resultatTest": "nt"
	},{			
		"themes": "Multimédia",
		"title": "Contenu préenregistré seulement audio&nbsp;: une transcription textuelle équivalente au contenu de l'audio est-elle présente&nbsp;?",
		"ID": "testID-041",
		"IDorigin": "testID-041",
		"wcag": [
			"1.2.1 A"
		],
		"verifier": "<p>Vérifier qu'un transcrit complet (texte contenant l'ensemble des informations auditives) est fourni sous forme de texte.<br>Cette transcription textuelle est alors&nbsp;:</p><ul><li>présente dans l'écran</li><li>ou disponible via un lien positionné à proximité de la piste audio</li></ul>",
		"group": "Multimédia",		
		"resultatTest": "nt"
	},{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée sans audio&nbsp;: une transcription textuelle ou une piste audio équivalente au contenu de la vidéo sont-elles présentes&nbsp;?",
		"ID": "testID-042",
		"IDorigin": "testID-042",
		"wcag": [
			"1.2.1 A"
		],
		"verifier": "<p>Vérifier qu'un transcrit complet (texte contenant l'ensemble des informations visuelles) est fourni sous forme de texte.<br>Cette transcription textuelle est alors&nbsp;: </p><ul><li>présente dans l'écran</li><li>ou disponible via un lien positionné à proximité de la vidéo</li><li>ou vérifier la présence d'une piste audio fournissant les informations présentées visuellement</li></ul>",
		"group": "Multimédia",		
		"resultatTest": "nt"
	},{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée (avec ou sans audio)&nbsp;: une transcription textuelle ou une audiodescription sont-elles présentes&nbsp;?",
		"ID": "testID-043",
		"IDorigin": "testID-043",
		"wcag": [
			"1.2.3 A"
		],
		"verifier": "<ul><li>Vérifier qu'un transcrit complet (texte contenant l'ensemble des informations auditives et visuelles) est fourni sous forme de texte.<br>Cette transcription textuelle est alors&nbsp;: <ul><li>présente dans l'écran</li><li>ou disponible via un lien positionné à proximité de la vidéo</li></ul></li><li>ou vérifier que pour toute vidéo, une audiodescription est disponible<ul><li>vérifier que l'audiodescription est correctement synchronisée</li><li>vérifier que l'audiodescription n'entre pas en conflit avec la piste audio de la vidéo (pas de perte d'information)</li><li>vérifier que l'audiodescription est pertinente</li></ul></li></ul>",
		"group": "Multimédia",		
		"resultatTest": "nt"
	},{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée (avec ou sans audio)&nbsp;: une audiodescription est-elle présente&nbsp;?",
		"ID": "testID-044",
		"IDorigin": "testID-044",
		"wcag": [
			"1.2.5 AA"
		],
		"verifier": "<ul><li>Vérifier que pour toute vidéo, une audiodescription est disponible.</li><li>Vérifier que l'audiodescription est correctement synchronisée.</li><li>Vérifier que l'audiodescription n'entre pas en conflit avec la piste audio de la vidéo (pas de perte d'information).</li><li>Vérifier que l'audiodescription est pertinente.</li></ul>",
		"group": "Multimédia",		
		"resultatTest": "nt"
	},{
		"themes": "Multimédia",
		"title": "Vidéo préenregistrée avec audio&nbsp;: des sous-titres transcrits sont-ils fournis pour tout le contenu&nbsp;?",
		"ID": "testID-045",
		"IDorigin": "testID-045",
		"wcag": [
			"1.2.2 A"
		],
		"verifier": "<ul><li>Vérifier que pour toute vidéo avec audio, des sous-titres sont disponibles.</li><li>Vérifier que les sous-titres sont pertinents (restitution de toutes les informations nécessaires à la compréhension, comme l'identité des orateurs).</li><li>Vérifier que les sous-titres ne masquent pas des informations importantes de la vidéo.</li></ul>",
		"group": "Multimédia",		
		"resultatTest": "nt"
	},{
		"themes": "Multimédia",
		"title": "Vidéo en direct avec audio&nbsp;: des sous-titres transcrits sont-ils fournis pour tout le contenu&nbsp;?",
		"ID": "testID-046",
		"IDorigin": "testID-046",
		"wcag": [
			"1.2.4 AA"
		],
		"verifier": "<ul><li>Vérifier que des sous-titres sont disponibles.</li><li>Vérifier que les sous-titres sont pertinents (restitution de toutes les informations nécessaires à la compréhension, comme l'identité des orateurs).</li></ul>",
		"complement": "<h4>Sous-titres transcrits</h4><p>Les sous-titres ne communiquent pas uniquement les dialogues, mais également toutes les autres informations audio nécessaires à la compréhension du contenu (ex&nbsp;: identifications des interlocuteurs, effets sonores…).</p>",
		"group": "Multimédia",		
		"resultatTest": "nt"
	},{
		"themes": "Multimédia",
		"title": "Si du son est lu automatiquement pendant plus de 3 secondes, l'utilisateur dispose-t-il d'un mécanisme pour le contrôler&nbsp;?",
		"ID": "testID-047",
		"IDorigin": "testID-047",
		"wcag": [
			"1.4.2 A"
		],
		"verifier": "<ul><li>Possibilité de mettre en pause ou d'arrêter le son.</li><li>Possibilité de régler le volume indépendamment du volume système.</li></ul>",
		"group": "Multimédia",		
		"resultatTest": "nt"
	},{
		"themes": "Multimédia",
		"title": "Des contrôles sont-ils présents pour interagir avec un média (pause, stop, volume, sous titres, etc...) ?",
		"ID": "testID-048",
		"IDorigin": "testID-048",
		"wcag": [
			"2.2.2 A"
		],
		"verifier": "<p>Vérifier que des contrôles sont présents pour interagir avec un média audio, ou un média vidéo.</p>",
		"group": "Multimédia",		
		"resultatTest": "nt"
	}
]}